GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c

// 07/03/15 - ADC TRIGGERing - associated TIMx CCR2's MMS field needs to be set
//            to 0x2 (Update) or 0x4 (CCR1, 0x5 (CCR2), 0x6 (CCR3), 0x7 (CCR4)
//            Right now, are only doing it for TIM6/7, but needs to be done
//            ofr ANY timer that needs to drive ADC (TIM1/TIM2/...)

/********1*********2*********3*********4*********5*********6*********7**********
*
*                       board_F4.c - STM32 F4
*
*
* STM32Cube / HAL based version of board_xxx() functions
*
*
* Supported/Tested Boards
* -----------------------
*      STM32_F4_01_RE    Nucleo-F4    512K Flash     96K RAM     84 MHz
*                                        1 ADC @ 16 channels
*                                        3 SPI       3 I2C       1 USB
*      STM32_F4_01_RE    Discovery
*
*
*  History:
*    12/30/14 - Created for Industrial IoT OpenSource project.  Duqu
*    04/xx/15 - Added multi-channel ADC support. Duqu
*    04/30/15 - Added multi-channel PWM support.  WORKS.   Duqu
*    05/25/15 - Fixed lingering issues in ADC DMA support. Duqu
*    07/03/15 - Merge in changes for Timer / PWM enhancements. Duqu
********************************************************************************
*   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -   -
*  Grandview DB/DC Systems             DRDA Portable Toolkit
*    Licensed Property of Grandview DC/DC Systems
*    (c) Copyright  Grandview DB/DC Systems  1994, 2002
*    All rights reserved
*
* CHANGE Copyright (C) 2014 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the
*    distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*******************************************************************************/

#include "boarddef.h"
#include "user_api.h"
#include <math.h>

#include "stm32f4xx_hal.h"


#if defined(USES_CC3000) || defined(CC3000_USE_BOOSTERPACK1)
long hci_unsolicited_event_handler(void);
#define  FALSE   0
#define  TRUE    1
#endif

// move the following to boarddef.h at some point
void board_system_clock_config (long mcu_clock_hz);     // internal Function protos
int  board_dac_check_conversions_done (int dac_module_id, int sequencer);
int  board_dac_clear_conversions_done (int dac_module_id, int sequencer);
int  board_dac_SineWave (int dac_module_id, int channel_num, long hz_frequency, long sps, int flags);
int  board_dac_Trianglewave (int dac_module_id, int channel_num, long hz_frequency, long sps, int flags);
int  board_dac_SquareWave  (int dac_module_id, int channel_num, long hz_frequency, long sps, int flags);
int  board_timerpwm_channel_lookup (int chan_id, int *chan_index);
int  board_timerpwm_enable_clock (int module_id);
long board_timerpwm_compute_prescalar (long period_val);
int  board_timerpwm_config_gpios (void *pwmblkp, int chan_id);
void board_error_handler (void);                    // subroutine prototypes

// internal Function protos
uint32_t HAL_GetTick (void);   // overrides for HAL Systick functions
void     HAL_IncTick (void);

void  DMA1_Channel1_IRQHandler (void);              // ADC DMA ISR - all channels
void  DMA2_Stream0_IRQHandler (void);               // DAC DMA ISR - all channels

//---------------------------------------------------------
//                    Global Variables
//---------------------------------------------------------
    P_EVENT_HANDLER      pIrqEventHandler = 0;
    int8_t               IntIsMasked;

    uint32_t   _g_SysClk_Ticks = MCU_CLOCK_SPEED; // Global to hold clock frequency (ticks/sec)

    uint32_t   _g_systick_millisecs = 0; // Global to how many 1 ms ticks have
                                         // accumulated startup (poor mans TOD)

    char       _g_vtimers_active    = 0; // Optional VTIMER support


    char       _g_pwm_mclock_configured = 0; // PWM master clock was configured
    uint32_t   _g_pwm_mdivider = 1;          // PWM Master clock : CPU divider ratio

    long       Systick_Frequency  = 100;    // 10 ms ticks
    long       SysTick_Reload_Val = 0;      // actual TMR reload value

    uint32_t   ulTickCount = 0;             // SysTick count


    SPI_HandleTypeDef  _g_hspi1;           // SPI 1 support
    SPI_HandleTypeDef  _g_hspi2;           // SPI 2 support
    SPI_HandleTypeDef  _g_hspi3;           // SPI 3 support
    DMA_HandleTypeDef  _g_hdma_spi2_rx;
    DMA_HandleTypeDef  _g_hdma_spi2_tx;

    short              _g_hspi1_type = 0;
    short              _g_hspi2_type = 0;
    short              _g_hspi3_type = 0;

    short              _g_spi_mode = 1;


#if (USES_BLUENRG_BLE)
extern    SPI_HandleTypeDef  SpiHandle;  // NOTE: ST's hci routines depend upon
                                         //    this hardcoded  SpiHandle  label.
                                         //    They have direct externs to it.
#endif



    short              IRQ_interrupts_enabled = -1;

