GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    long               irq_state;
    long               ulSpiIRQState;

    long               brc;

    unsigned char      Hci_Link_Start []   = { 0x01,0x00,0x05,0x00,0x00,
                                               0x01,0x00,0x40,0x01,0x00  };
    unsigned char      Hci_Link_Reply [10] = { 0,0,0,0,0,0,0,0,0,0 };

#if defined(USES_CONSOLE_WRITE) || defined(USES_CONSOLE_READ) || defined(USES_DEBUG_LOG)
    char   _g_uart_buf_idx   = 0;        // keeps track of user input via UART
    char   _g_uart_last_char = 0;
    UART_HandleTypeDef   _g_UartHandle;
#endif

#if defined(USES_UNIQUEID) || defined(USES_MQTT)
    unsigned long   _g_crcid_Result;
#endif

               //----------------------------------------------
               //  Lookup table to obtain GPIO Port Addresses
               //----------------------------------------------
const  GPIO_TypeDef * _g_gpio_base[] =
    {
        0L,
        GPIOA,
        GPIOB,
        GPIOC,
        GPIOD,
        GPIOE
    };
#define  GP_PORT_A   1        // indexes into above table, based on port id
#define  GP_PORT_B   2
#define  GP_PORT_C   3
#define  GP_PORT_D   4
#define  GP_PORT_E   5


//**************************************************************************
//**************************************************************************
//
//                     BOARD   -   COMMON   Routines
//
//**************************************************************************
//**************************************************************************

//******************************************************************************
//  board_init
//
//            Initializes board clocks and basic GPIOs.
//******************************************************************************

void  board_init (long mcu_clock_rate)
{
       //-----------------------------------------------------------------------
       // Reset all peripherals, Initialize Flash interface and Systick.
       // This calls the generic HAL_Init() in stm32f3xx_hal.c
       // which in turn does a callback to our specific peripherals GPIO init
       // for SPI, DMA, ... by invoking HAL_MspInit() in our stm32f3xx_hal_msp.c
       //-----------------------------------------------------------------------
    board_stop_WDT();                 // ensure watchdog timer is off/disabled

    HAL_Init();                       // Invoke ST's HAL startup logic

    if (mcu_clock_rate != 0)
       board_system_clock_config (mcu_clock_rate); // user has specified MCU speed
       else board_system_clock_config (MCU_CLOCK_SPEED);  // use default MCU speed

#if defined(USES_SYSTICK) || defined(USES_MQTT) || defined(USES_ADC) || defined(USES_VTIMER)
    board_systick_timer_config();     // ensure Systick timer is turned on
#endif

       //------------------------------------------------------------------
       //   Configure basic GPIO clocks and any GPIOs needed
       //------------------------------------------------------------------
    board_gpio_init();

        // Enable the UART if user wants to invoke CONSOLE or DEBUG_LOG calls
#if defined(USES_CONSOLE_WRITE) || defined(USES_CONSOLE_READ) || defined(USES_DEBUG_LOG)
    board_uart_init();          // go ahead and enable the default UART
#endif

}


//*****************************************************************************
//  board_busy_wait_usec
//
//           Continuously loop until a fixed time delay has completed.
//           This function provides a means of generating a constant
//           length. The function delay (in cycles) = 3 * parameter, so
//           divide the SystemClock to yield the approperiate usec value
//           1 usec Delay = (50 MHz / 1 million) / 3 = 16.6667
//*****************************************************************************

void  board_busy_wait_usec (long usec_delay)
{
    long  total_ticks;

//  total_ticks = (long) (g_fusec_to_ticks * (float) usec_delay);
    total_ticks = (long) (8 * (float) usec_delay);       // TEMP HACK 03/11/15

    while (total_ticks > 0)
       total_ticks -= 3;                  // each iteration is approx 3 instr
}


//*****************************************************************************
//  board_delay_ms
//
//            Produce a delay in milli-seconds (ms)
//*****************************************************************************

void  board_delay_ms (long num_millis)    // Delay of 1 ms
{

    HAL_Delay ((uint32_t) num_millis);
}


//*****************************************************************************
//  Delay
//
//          Produce a delay in milli-seconds (ms)      Used by CC3xxx Simplelink
//*****************************************************************************

void  Delay (unsigned long delay_interval)
{
     board_delay_ms (delay_interval);
}


//*****************************************************************************
//  board_disable_global_interrupts
//
//
//         Turn off Global interrupts  (for CC3000, Timer config, ...)
//
//         ASM ("cpsid i");   // CAUTION: do NOT do any SVC calls or will crash
//*****************************************************************************

void  board_disable_global_interrupts (void)
{
        //------------------------------
        // Disable processor interrupts.
        //------------------------------
     __disable_irq();              // GNU and IAR synonym
//   ___disableinterrupt();        // native IAR
}


//*****************************************************************************
//  board_enable_global_interrupts
//
//         Turn on Global interrupts  (for CC3000, Interval Timer,
//                                     PWM Timer, ADC, config ...)
//         ASM ("cpsie i");
//*****************************************************************************

void  board_enable_global_interrupts (void)
{
        //------------------------------
        // Enable processor interrupts.
        //------------------------------
     __enable_irq();              // GNU and IAR synonym
//   ___enableinterrupt();        // native IAR
}


//*****************************************************************************
//  board_error_handler
//
//          Catastrophic error occurred. Stop the train.
//*****************************************************************************

void  board_error_handler (void)
{
           /* Turn LED on */
    // BSP_LED_On (LED2);
    while (1)
      {                 // loop in here so Debugger can find it
      }
}


//*****************************************************************************
//  board_frequency_to_period_ticks
//
//      Takes a frequency (e.g. for PWM or Timer), and converts it to the
//      equivalent clock ticks period value to be loaded into PWM registers.
//      If the result value would be too large, PWM/Timer code would have
//      to further sub-divide it using pre-scalars
//*****************************************************************************

long  board_frequency_to_period_ticks (long frequency)
{
    long   pticks;

