GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
        // take the current clock frequency, and compute the associated ticks
        // needed to generate that frequency.
     pticks = _g_SysClk_Ticks / frequency;

     return (pticks);
}



#if defined(USES_ADC)

//*****************************************************************************
//*****************************************************************************
//                               ADC   Routines
//*****************************************************************************
//*****************************************************************************

    int              _g_ADC_complete    = 0;  // 1 = all ADC conversions/DMAs are complete
    char             _g_adc_clocks_on   = 0;
    char             _g_active_channels = 0;
    int              _g_sequencer       = 0;
    int              _g_step_num        = 1;  // first sequencer step always = 1

    int              _g_trigger_atmrpwm      = 0; // index to correct Timer/PWM
    uint16_t         _g_trigger_auser_api_id = 0; // User API id for the trigger
    uint16_t         _g_trigger_atmr_mmsmask = 0; // Associated Mask for TIM's  MMS
    uint32_t         _g_trigger_adc_extmask  = 0; // Associated mask for ADC CR2 EXTSEL

    unsigned char    _g_adc_step_map [16] = { 0 };  // indexed by channel #

    unsigned short   _g_adc_conv_results[16];    // Internal buf to hold ADC DMAed results

ADC_CB_EVENT_HANDLER _g_adc_callback       = 0L;
    void             *_g_adc_callback_parm = 0;

    int              _g_DMA_complete  = 0;       // 1 = all ADC conversion DMAs are complete
    char             _g_DMA_overrun   = 0;       // 1 = DMA completed a new set before the previous one was processed
    unsigned long    dma_callback_seen = 0;      // DEBUG COUNTERs
    unsigned long    dma_rupt_seen     = 0;

    ADC_HandleTypeDef       _g_AdcHandle;
    ADC_ChannelConfTypeDef  _g_ChanConfig;
    DMA_HandleTypeDef       _g_DmaHandle;

    void  ADC1_DMA_IRQHandler (void);              // Function Prototypes

typedef struct adc_module_def          /* ADC Module definitions */
    {
        ADC_TypeDef  *adc_base;        /* ADC base address */
    } ADC_MODULE_BLK;

typedef struct adc_channel_def         /* ADC Channel definitions */
    {
        GPIO_TypeDef *chan_gpio_port;  /* Associated GPIO port           */
        uint32_t     chan_gpio_pin;    /* Associated GPIO pin            */
        uint32_t     chan_alt_func;    /* Channel Alternate Function Id  */
        uint32_t     chan_adc_id;      /* Logical Channel id for this ADC */
    } ADC_CHANNEL_BLK;


typedef struct adc_trigger_def         /* ADC Trigger definitions */
    {
        uint16_t     trigger_user_api_id; /* User API id for the trigger   */
        uint16_t     trigger_tmr_mmsmask; /* Associated Mask for TIM MMS   */
        uint32_t     trigger_adc_extmask; /* Associated Mask for ADC EXTSEL*/
    } ADC_TRIGGER_BLK;


const ADC_MODULE_BLK  _g_adc_modules [] =
        {  {    0L     },
           { ADC1 },
//         { ADC2 },
//         { ADC3 }     // ADC_MODULE_ANY defaults to ADC0     FROM TIVA
        };


// note: on STM32, user indexes start at 0, to handle channel 0 on STM's
const ADC_CHANNEL_BLK  _g_adc_channels [] =        // STM32  Arduino  User Index
        {  { GPIOA, GPIO_PIN_0, 0, ADC_CHANNEL_0  },  // PA0    A0      0
           { GPIOA, GPIO_PIN_1, 0, ADC_CHANNEL_1  },  // PA1    A1      1
           { GPIOA, GPIO_PIN_2, 0, ADC_CHANNEL_2  },  // PA2            2
           { GPIOA, GPIO_PIN_3, 0, ADC_CHANNEL_3  },  // PA3            3
           { GPIOA, GPIO_PIN_4, 0, ADC_CHANNEL_4  },  // PA4    A2      4
           { GPIOA, GPIO_PIN_5, 0, ADC_CHANNEL_5  },  // PA5            5
           { GPIOA, GPIO_PIN_6, 0, ADC_CHANNEL_6  },  // PA6            6
           { GPIOA, GPIO_PIN_7, 0, ADC_CHANNEL_7  },  // PA7            7
           { GPIOB, GPIO_PIN_0, 0, ADC_CHANNEL_8  },  // PB0    A3      8
           { GPIOB, GPIO_PIN_1, 0, ADC_CHANNEL_9  },  // PB1            9
           { GPIOC, GPIO_PIN_0, 0, ADC_CHANNEL_10 },  // PC0    A5     10
           { GPIOC, GPIO_PIN_1, 0, ADC_CHANNEL_11 },  // PC1    A4     11
           { GPIOC, GPIO_PIN_2, 0, ADC_CHANNEL_12 },  // PC2           12
           { GPIOC, GPIO_PIN_3, 0, ADC_CHANNEL_13 },  // PC3           13
           { GPIOC, GPIO_PIN_4, 0, ADC_CHANNEL_14 },  // PC4           14
           { GPIOC, GPIO_PIN_5, 0, ADC_CHANNEL_15 }   // PC5           15
        };

              //-----------------------------------------------
              // Triggerable Timers/Events available on F4 ADC
              //    - TIM1_TRGO      - TIM1_CC4
              //    - TIM2_TRGO      - TIM3_TRGO
              //    - TIM15_TRGO
              //------------------------------------------------
const ADC_TRIGGER_BLK _g_adc_trigger_config_table [] =
        {      // User API          TIM MMS         ADC EXTSEL
          { ADC_TRIGGER_TIMER_1_CC1, TIM_TRGO_OC1REF, ADC_EXTERNALTRIGCONV_T1_CC1 },  // TImer1 CC1
          { ADC_TRIGGER_TIMER_1_CC2, TIM_TRGO_OC2REF, ADC_EXTERNALTRIGCONV_T1_CC2 },  // TImer1 CC2
          { ADC_TRIGGER_TIMER_1_CC3, TIM_TRGO_OC3REF, ADC_EXTERNALTRIGCONV_T1_CC3 },  // TImer1 CC3

          { ADC_TRIGGER_TIMER_2_CC2, TIM_TRGO_OC2REF, ADC_EXTERNALTRIGCONV_T2_CC2 },  // TImer2 CC2
          { ADC_TRIGGER_TIMER_2_CC3, TIM_TRGO_OC3REF, ADC_EXTERNALTRIGCONV_T2_CC3 },  // TImer2 CC3
          { ADC_TRIGGER_TIMER_2_CC4, TIM_TRGO_OC4REF, ADC_EXTERNALTRIGCONV_T2_CC4 },  // TImer2 CC4
          { ADC_TRIGGER_TIMER_2,     TIM_TRGO_UPDATE, ADC_EXTERNALTRIGCONV_T2_TRGO},  // TImer2 Update/TRG0

          { ADC_TRIGGER_TIMER_3_CC1, TIM_TRGO_OC1REF, ADC_EXTERNALTRIGCONV_T3_CC1 },  // TImer3 CC1
          { ADC_TRIGGER_TIMER_3,     TIM_TRGO_UPDATE, ADC_EXTERNALTRIGCONV_T3_TRGO},  // TImer3 Update/TRG0

          { ADC_TRIGGER_TIMER_4_CC4, TIM_TRGO_OC4REF, ADC_EXTERNALTRIGCONV_T4_CC4 },  // TImer4 CC4

          { ADC_TRIGGER_TIMER_5_CC1, TIM_TRGO_OC1REF, ADC_EXTERNALTRIGCONV_T5_CC1 },  // TImer5 CC1
          { ADC_TRIGGER_TIMER_5_CC2, TIM_TRGO_OC2REF, ADC_EXTERNALTRIGCONV_T5_CC2 },  // TImer5 CC2
          { ADC_TRIGGER_TIMER_5_CC3, TIM_TRGO_OC3REF, ADC_EXTERNALTRIGCONV_T5_CC3 },  // TImer5 CC3

          { ADC_TRIGGER_TIMER_5_CC1, TIM_TRGO_OC1REF, ADC_EXTERNALTRIGCONV_T8_CC1 },  // TImer8 CC1
          { ADC_TRIGGER_TIMER_8,     TIM_TRGO_UPDATE, ADC_EXTERNALTRIGCONV_T8_TRGO},  // TImer8 Update/TRG0
          { ADC_TRIGGER_GPIO_PIN,          0,         ADC_EXTERNALTRIGCONV_Ext_IT11 },// External GPIO
          {     -1,                        0,                     0               }   // end of table
        };



//*****************************************************************************
//  board_adc_init
//
//         Initialize an ADC module, and configure the overall sampling
//         clock used for the ADC channels on a module.
//
//         The default is set to XXXX.
//         This call allows an experienced programmer to override that default.
//
//         trigger_type specifies the type of trigger that will be used
//           - User App
//           - PWM Module 0  Generator 0 / 1 / 2 / 3
//           - PWM Module 1  Generator 0 / 1 / 2 / 3
//           - Timer n
//           - Comparator n
//
// Note that on most platforms, the Triggering is _module_ wide, in other
//      words, all channels (ADC 1-16) will be triggered off the same timer/pwm.
//
// STM32-F4 has 1 ADC moodule, with a single sequencer allowing up to 16 channels.
// The sequencer steps are individually identified:  ADC_SQR1 -> ADC_SQR3.
// ADC results are stored in a single 32-bit register: ADC_DR
// Results are stored in the lower order 16-bits.
// We use DMA to process multiple ADC conversion results, to avoid
// "interrupt per channel" overhead and complexity.
//
// The STM32-F4 Nucleo 64-pin device physically supports up to 16 channels,
// of which 5 are wired out to the Nucleo/Arduino pins.
// Two internal sources (Temperature Sensor, Battery Monitor) are also available.
// The other ADCs are wired out to the "Morpho" connector.
// We allow support for all 16 channels.
//
// The STM32-F4 supports a single 12-bit ADC, with up to 16 Channels.
//*****************************************************************************

int  board_adc_init (int adc_module_id, uint32_t clock_rate,  int trigger_type,
                     int flags)
{
    ADC_TRIGGER_BLK  *trigblkp;
    int              rc;

       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if (_g_adc_clocks_on == 0)
       {     // turn on the clocks for the ADC module  (Is only 1 on STM32 F4)
         __HAL_RCC_ADC1_CLK_ENABLE();            // Enable ADC Periph clock
         __HAL_RCC_DMA2_CLK_ENABLE();            // Enable DMA2 clock
         _g_adc_clocks_on = 1;                   // denote clocks are now on

             //-----------------------------------------------------------------
             // This is the opportune time to do initial config of the ADC and
             // DMA modules. Note that we will later have to manuually override
             // the initial number of ADC channels (set SQR1 xxxx value).
             //
             // If calibration is required, call that out as a separate subrtn.
             // Because F4 only has 1 ADC module, we can hard-code it.
             //-----------------------------------------------------------------
         _g_AdcHandle.Instance                   = ADC1; // single module: ADC1
         _g_AdcHandle.Init.NbrOfConversion       = 1;    // - this gets modified -
         _g_AdcHandle.Init.DMAContinuousRequests = ENABLE;             // Use DMA
         _g_AdcHandle.Init.Resolution            = ADC_RESOLUTION_12B; // 12 bit resol
         _g_AdcHandle.Init.ClockPrescaler        = ADC_CLOCKPRESCALER_PCLK_DIV2;

         if (trigger_type == ADC_TRIGGER_USER_APP)
            {     //-----------------------------------------------------------
                  // no external triggers - use SW trigger calls from User App
                  //-----------------------------------------------------------
              _g_AdcHandle.Init.ExternalTrigConv     = ADC_SOFTWARE_START;
              _g_AdcHandle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_NONE;
            }
          else
            {      //-------------------------------------------------------------
                   // loop thru trigger table, find entry, and save needed flags.
                   //
                   // We do not turn on all the trigger related TIM flags
                   // until adc_enable() is requested.
                   // We also require the User App issue a timer_ADC_Trigger_Start()
                   // at some point, to cause the ADC to start sampling.
                   //-------------------------------------------------------------
              trigblkp = (ADC_TRIGGER_BLK*) &_g_adc_trigger_config_table[0];
              while (1)
                { if (trigblkp->trigger_user_api_id == -1)
                     return (ERR_ADC_UNSUPPORTED_TRIGGER_TYPE);  // end of table and no match
                  if (trigblkp->trigger_user_api_id == trigger_type)
                     {     // setup _g_AdcHandle.Init with proper Trigger flags
                       _g_AdcHandle.Init.ExternalTrigConv = trigblkp->trigger_adc_extmask;
                       if (flags & ADC_TRIGGER_FALLING)
                          _g_AdcHandle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_FALLING;
                          else if (flags & ADC_TRIGGER_RISEFALL)
                                  _g_AdcHandle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISINGFALLING;
                                  else _g_AdcHandle.Init.ExternalTrigConvEdge = ADC_EXTERNALTRIGCONVEDGE_RISING;
                           // save rest of parms to tb used at adc_enable() and timerpwm_enable()
                       _g_trigger_adc_extmask  = trigblkp->trigger_adc_extmask; // ADC EXTSEL
                       _g_trigger_atmr_mmsmask = trigblkp->trigger_tmr_mmsmask; // TIM MMS
                       _g_trigger_auser_api_id = trigger_type;
                           // the User API trigger type is an encoded field
                           // where the low order 4 bits = CCR, and the rest = index
                           // number of associated Timer/PWM
                       if (trigblkp->trigger_tmr_mmsmask != 0)      // a GEXTI GPIO pin = 0
                          _g_trigger_atmrpwm = (trigger_type >> 4); // save Timer/PWM index
                       break;             // bail out of loop
                     }
                  trigblkp++;             // step to nexct entry in array
                }
            }

         _g_AdcHandle.Init.ScanConvMode          = ENABLE;  // scan multiple channels
         _g_AdcHandle.Init.ContinuousConvMode    = DISABLE; // only when trigger
         _g_AdcHandle.Init.DiscontinuousConvMode = DISABLE; // not used
         _g_AdcHandle.Init.NbrOfDiscConversion   = 0;
         _g_AdcHandle.Init.DataAlign             = ADC_DATAALIGN_RIGHT;
         _g_AdcHandle.Init.EOCSelection          = DISABLE; // DMA will interrupt
                                                            //   not ADC EOC.
         rc = HAL_ADC_Init (&_g_AdcHandle);
         if (rc != HAL_OK)
            {
                 /* Initialization Error */
              board_error_handler();           // return error code instead  ???
            }

             //-----------------------------------------------------------------
             // Initialize the DMA associated with the ADC module.
             //   ?? Or should we hold off on this until we hit adc_enable() ?
             //-----------------------------------------------------------------
         _g_DmaHandle.Instance         = DMA2_Stream0;
         _g_DmaHandle.Init.Channel     = DMA_CHANNEL_0;
         _g_DmaHandle.Init.Direction   = DMA_PERIPH_TO_MEMORY;  // ADC -> RAM

         _g_DmaHandle.Init.PeriphInc   = DMA_PINC_DISABLE;
         _g_DmaHandle.Init.MemInc      = DMA_MINC_ENABLE;       // step buf ptr
         _g_DmaHandle.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;  // for 16 bit results
         _g_DmaHandle.Init.MemDataAlignment    = DMA_MDATAALIGN_HALFWORD;  // ditto
         _g_DmaHandle.Init.Mode        = DMA_CIRCULAR;     // Treat as circular buf
         _g_DmaHandle.Init.Priority    = DMA_PRIORITY_HIGH;
         _g_DmaHandle.Init.FIFOMode    = DMA_FIFOMODE_DISABLE;
         _g_DmaHandle.Init.FIFOThreshold = DMA_FIFO_THRESHOLD_FULL;
         _g_DmaHandle.Init.MemBurst    = DMA_MBURST_SINGLE;
         _g_DmaHandle.Init.PeriphBurst = DMA_PBURST_SINGLE;

