GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
         rc = HAL_DMA_Init (&_g_DmaHandle);

            // Associate the initialized DMA handle to the the ADC handle
         __HAL_LINKDMA (&_g_AdcHandle, DMA_Handle, _g_DmaHandle);

            //----------------------------------------------------------
            //          Configure the NVIC for DMA interrupts
            // Configure NVIC for DMA transfer complete interrupt.
            //----------------------------------------------------------
         HAL_NVIC_SetPriority (DMA2_Stream0_IRQn, 0, 0);
         HAL_NVIC_EnableIRQ (DMA2_Stream0_IRQn);
       }

    return (0);           // denote success
}


//*****************************************************************************
//  board_adc_config_channel
//
//         Configure a single ADC channel.
//
//         Note that the sampling rate will be determined by the trigger source.
//
//         adc_module parm is really just an index number (0-3)
//         that denote which ADC module to use.
//         For the STM32 F4, there is only 1 ADC module: ADC1
//
//         The flags value is passed to denote:
//           - priority 0-3                            (NOW)
//           - if interrupts and/or DMA should be used (FUTURE UPGRADE)
//           - Comparator and/or Reference used        (FUTURE_UPGRAGDE)
//
//         STM32 F4 supports a max of 16 ADC channels and 1 ADC module.
//         It has only 1 main sequencer.
//*****************************************************************************

int  board_adc_config_channel (int adc_module_id, int channel_num,
                               int sequencer,  int step_num,
                               int last,  int flags)
{
    GPIO_InitTypeDef  GPIO_InitStruct;
    ADC_CHANNEL_BLK  *adcblkp;
    int               orig_step_num;
    int               rc;

       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if (channel_num < 0  ||  channel_num > 15)
       return (ERR_ADC_CHANNEL_NUM_OUT_OF_RANGE);

    if ( ! _g_adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

          //-----------------------------------------------------
          // set the associated GPIO pin to act as an ADC input.
          //
          // Convert channel number to an index into table of 16 entries
          // that contains pin # and GPIO base index, then use  _g_gpio_base[]
          //----------------------------------------------------
    adcblkp = (ADC_CHANNEL_BLK*) &_g_adc_channels [channel_num];
         // first configure it as a straight GPIO Input, to clear everything out
    GPIO_InitStruct.Pin   = adcblkp->chan_gpio_pin;
    GPIO_InitStruct.Mode  = GPIO_MODE_INPUT;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init (adcblkp->chan_gpio_port, &GPIO_InitStruct);
         // then configure it over to an Analog Input
    GPIO_InitStruct.Pin  = adcblkp->chan_gpio_pin;
    GPIO_InitStruct.Mode = GPIO_MODE_ANALOG;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    HAL_GPIO_Init (adcblkp->chan_gpio_port, &GPIO_InitStruct);

          //----------------------------------------------------------------
          // setup the step within the sequencer to use
          //----------------------------------------------------------------
    orig_step_num = step_num;          // save the step number passed on entry
    if (step_num == ADC_AUTO_STEP)
       step_num = _g_step_num;         // use our internally managed step #

       //-----------------------------------------------------------------
       // Configure the associated ADC channel     (as a regular channel)
       //
       // Note: Based on the intterupts (IT) that occur after each number
       //       "uhADCxConvertedValue"  ADC conversions (IT by DMA end
       //       of transfer), select sampling time and ADC clock with sufficient
       //       duration as to not create an overhead situation in IRQHandler.
       //
       // Note that "Rank" is really sequence id - the sequence in which
       // these will fire, starting at one, and going up.
       //-----------------------------------------------------------------
    _g_ChanConfig.Channel      = adcblkp->chan_adc_id;    // set ADC channel #
    _g_ChanConfig.Rank         = step_num;            // set step # in sequencer
    _g_ChanConfig.SamplingTime = ADC_SAMPLETIME_28CYCLES;
    _g_ChanConfig.Offset       = 0;

    rc = HAL_ADC_ConfigChannel (&_g_AdcHandle, &_g_ChanConfig);
    if (rc != HAL_OK)
       {
            /* Channel Configuration Error */
         board_error_handler();           // return error code instead  ???
       }

          // save the step number that was used for this channel
    _g_adc_step_map [channel_num] = (char) step_num;

    if (orig_step_num == ADC_AUTO_STEP)
       _g_step_num++;          // inc to next step slot in the sequencer

          // track how many channels have been configured for use
    _g_active_channels++;

    return (0);                // denote success
}


//*****************************************************************************
//  board_adc_check_conversions_done
//
//          Checks if the ALL the conversions for a sinple ADC are done.
//
//          For groups, the starting channel of the group, as specified as
//          the first channel listed in the board_adc_group_init() channels[]
//          array, is passed.
//*****************************************************************************
int  board_adc_check_conversions_done (int adc_module_id, int sequencer)
{
       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    if ( ! _g_DMA_complete)
       return (0);                       // ADC and DMA are still busy

    return (1);                          // All conversions are completed
}


//*****************************************************************************
//  board_adc_enable
//
//          Turn on one or all the sequencers that have been configured.
//*****************************************************************************
int  board_adc_enable (int adc_module_id, int sequencer)
{
    uint32_t   DataEntries;
    int        rc;

       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

       // Because there is only 1 sequencer, we ignore the sequencer check
//  if (sequencer < 0 || sequencer > ADC_AUTO_SEQUENCE)
//     return (ERR_ADC_SEQUENCER_ID_OUT_OF_RANGE);

//  if (sequencer == ADC_AUTO_SEQUENCE)
//     sequencer = _g_sequencer;  // use current auto-managed sequencer

