GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    if ( !  _g_adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    _g_DMA_complete = 0;  // clear I/O flags
    _g_DMA_overrun  = 0;

        //------------------------------------------------------------------
        // Update the "Number of Copnversions" in the ADC block
        // based upon the final number of channels configured.
        // To do this, we must update the ADC_SQR1_L field in SQR1 register
        //------------------------------------------------------------------
    _g_AdcHandle.Instance->SQR1 &= ~(ADC_SQR1_L);         // clear the bits
    _g_AdcHandle.Instance->SQR1 |= ADC_SQR1(_g_active_channels);

        //----------------------------------------------------------------------
        // the following both starts the ADC and apparently auto-initiates
        // the first Conversion IFF SW initiated, else lets trigger do its thing
        //----------------------------------------------------------------------
    DataEntries = _g_active_channels * 1;  // set # entries that DMA should xfer
    rc = HAL_ADC_Start_DMA (&_g_AdcHandle, (uint32_t*) &_g_adc_conv_results,
                            DataEntries);
    if (rc != HAL_OK)
       {
            /* Had a start Conversion Error */
         board_error_handler();           // return error code instead  ???
       }
    return (0);                                    // denote success
}


//*****************************************************************************
//  board_adc_disable
//
//          Turn off one or all the sequencers that have been configured.
//
//          Reset everything in preparattioon for a re-configuratioon of
//          channels.
//*****************************************************************************
int  board_adc_disable (int adc_module_id, int sequencer)
{
       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

    HAL_ADC_Stop_DMA (&_g_AdcHandle);

    return (0);                                     // denote success
}


//*****************************************************************************
//  board_adc_get_results
//
//          Returns an array of all the ADC values that were converted,
//          related to a/all the sequenced group(s)
//*****************************************************************************
int  board_adc_get_results (int adc_module_id, int sequencer,
                            uint16_t *channel_results)
{
    uint32_t  adc_module;
    int      i;

       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

       // Because there is only 1 sequencer, we ignore the sequencer check
//  if (sequencer < 0 || sequencer > ADC_AUTO_SEQUENCE)
//     return (ERR_ADC_SEQUENCER_ID_OUT_OF_RANGE);

// CAUTION: TI's code will automatically read an entire ARRAY (from FIFO)
//          if a sequence group is involved

//  rc = ADCSequenceDataGet (uint32_t ui32Base, uint32_t ui32SequenceNum,
//                           uint32_t *pui32Buffer)

//  channel_results[0] = HAL_ADC_GetValue (ADC1);   DMA will have already put it in channel_results

    if ( ! _g_adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    if (_g_DMA_complete == 0)
       return (0);     // denote 0 results because DMA rupt has not happened yet

    if (_g_DMA_overrun)
       {    // we had an overrun. Discard the results and tell user try again
         _g_DMA_overrun  = 0;  // clear error flag
         _g_DMA_complete = 0;  // reset for new pass
         return (-1);          // denote we had an overrun condition
       }
    for (i = 0;  i < _g_active_channels;  i++)
       {       // copy the internally DMA staged results into user's buffer
         channel_results[i] = _g_adc_conv_results[i];
       }

    _g_DMA_complete = 0;         // reset for new pass

    return (_g_active_channels); // pass back number of completed conversions
}


//*****************************************************************************
//  board_adc_user_trigger_start
//
//          Trigger sampling for a group of ADCs, on a sequenced group
//*****************************************************************************
int  board_adc_user_trigger_start (int adc_module_id, int sequencer)
{
    uint32_t   adc_module;
    uint32_t   DataEntries;
    int        rc;

       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

       // Because there is only 1 sequencer, we ignore the sequencer check
//  if (sequencer < 0 || sequencer > ADC_AUTO_SEQUENCE)
//     return (ERR_ADC_SEQUENCER_ID_OUT_OF_RANGE);

//  if (sequencer == ADC_AUTO_SEQUENCE)
//     sequencer = _g_sequencer;      // use current auto-managed sequencer

    if ( ! _g_adc_clocks_on)
       return (ERR_ADC_MODULE_NOT_INITIALIZED);

    _g_DMA_complete = 0;              // clear I/O flags for new pass
    _g_DMA_overrun  = 0;

        // apparently, to start another ADC conversion, you must issue
        // another xxx_Start_IT()  or  xxx_Start_DMA() request !
// DMA was already initialized and setup for circular mode (effectively resets
// after every cycle). So all we want to do now is trigger the ADC Start again.
// Do not re-init everything, it can cause crashes/faults
//  DataEntries = _g_active_channels * 1;   // set # entries that DMA should xfer
//  rc = HAL_ADC_Start_DMA (&_g_AdcHandle, (uint32_t*) &_g_adc_conv_results,
//                          DataEntries);
    rc = HAL_ADC_Start_IT (&_g_AdcHandle); // Issue software start (SW) to ADC and DMA
    if (rc != HAL_OK)
       {
            /* Had a start Conversion Error */
         board_error_handler();            // return error code instead  ???
       }

