GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    return (0);                                    // denote success
}


//*****************************************************************************
//  board_adc_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when the ADC conversions are complete.
//*****************************************************************************
int  board_adc_set_callback (int adc_module_id,
                             ADC_CB_EVENT_HANDLER callback_function,
                             void *callback_parm)
{
       // Because there is only 1 ADC module, we ignore the adc_module_id check
//  if (adc_module_id < 0  ||  adc_module_id > ADC_AUTO_MODULE)
//     return (ERR_ADC_MODULE_ID_OUT_OF_RANGE);

        //----------------------------------------------------------------
        // Save ADC completion callback parameters.
        //----------------------------------------------------------------
    _g_adc_callback      = callback_function;
    _g_adc_callback_parm = callback_parm;

    return (0);                           // denote success
}


/****************************************************************************
*                             ADC  ISR   Callback
*
*         ADC Conversion complete callback in non-blocking mode.
*         Called from DMA/ADC ISR Handler.
*
*         If running straight interrupts (xxx_IT), this gets called by
*         the HAL ADC library support when the ADC interrupt completes.
*
*         If running with DMA (xxx_DMA), this gets called
*         when the DMA interrupt completes, i.e. this gets
*         invoked as a callback indirectly via the HAL_DMA_IRQHandler()
*
* @param  _g_AdcHandle : _g_AdcHandle handle
* @note   This example shows a simple way to report end of conversion,
*         and you can add your own implementation.
* @retval None
****************************************************************************/
void   HAL_ADC_ConvCpltCallback (ADC_HandleTypeDef *_g_AdcHandle)
{
    dma_callback_seen++;                        // DEBUG COUNTER

// ??? !!!  ADD REST OF SUPPORT FOR THIS on 06/26/15 ---- ??? !!!

       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (_g_adc_callback != 0L)
       {
          (_g_adc_callback) (_g_adc_callback_parm, _g_adc_conv_results,
                             _g_active_channels, 0);    // Call user handler
       }
}


/************************************************************************
*                              DMA  ADC  ISR
*
* @brief  This handles the DMA interrupt request for the ADC DMA channel.
*         It routes it to the ST hAL library, which does some
*         pre-pcoessing on it, then invokes the associated
*         callback we defined (HAL_ADC_ConvCpltCallback)
*
* @param  None
* @retval None
************************************************************************/

void  DMA2_Stream0_IRQHandler (void)
{
    dma_rupt_seen++;                               // DEBUG COUNTER

    _g_DMA_complete = 1;     // set status that ADCs and DMA completed.
                             // Used by adc_Check_All_Complete() logic.
                             // Alternative option = invoke user callback rtn.

// ??? is the foolowing really needed - should I just clear it in here and be done with it ???

    HAL_DMA_IRQHandler (_g_AdcHandle.DMA_Handle);  // Call post rupt cleanup
                                                   //   and reset rupt flags

       //-------------------------------------------------------------
       // If a ADC completion callback has been configured, invoke it
       //-------------------------------------------------------------
    if (_g_adc_callback != 0L)
       {
          (_g_adc_callback) (_g_adc_callback_parm, _g_adc_conv_results,
                             _g_active_channels, 0);    // Call user handler
       }

//  HAL_ADC_Stop_DMA(hadc);  // ??? need - bit is blow up when re-enable ADC_IT
}

#endif                       //  defined(USES_ADC)




     uint16_t        _g_trigger_dtmr_mmsmask = 0; // Associated Mask for TIM's  MMS
     uint16_t        _g_trigger_duser_api_id = 0; // Associated DAC trigger type from dac_Init()
/////                MasterSlaveConfig.MasterOutputTrigger = TIM_TRGO_UPDATE;

#if defined(USES_DAC)

//*****************************************************************************
//*****************************************************************************
//                               DAC   Routines
//*****************************************************************************
//*****************************************************************************

    // STM32 F4 has no on-board DACs.  Must use an external SPI attached DAC

#endif                       //  defined(USES_DAC)




//*****************************************************************************
//*****************************************************************************
//                               GPIO   Routines
//*****************************************************************************
//*****************************************************************************

/*******************************************************************************
*  Board GPIO Init
*
*        Initialize GPIO pins needed by CC3000:  SPI CS, ENABLE,  IRQ
*******************************************************************************/
void  board_gpio_init (void)
{
    GPIO_InitTypeDef   GPIO_InitStruct;

    __HAL_RCC_GPIOA_CLK_ENABLE();     // turn on GPIO clocks for Ports A, B, C
    __HAL_RCC_GPIOB_CLK_ENABLE();     // since they are used in many spots
    __HAL_RCC_GPIOC_CLK_ENABLE();

#if defined(USES_CC3000) || defined(USES_CC3100) || defined(USES_CC3200)
        //--------------------------------------------
        // Configure GPIO pins:  PB4 (CC3000_ENABLE)
        //                       PB6 (SPI_CS_CC3000)
        //--------------------------------------------
    GPIO_InitStruct.Pin   = GPIO_PIN_4 | GPIO_PIN_6;
    GPIO_InitStruct.Mode  = GPIO_MODE_OUTPUT_PP;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init (GPIOB, &GPIO_InitStruct);

