GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
        //---------------------------------------------------------
        // Configure GPIO pin:   PB3 (CC3000_IRQ)
        //
        // Note:  IRQ is signalled by a FALLING edge.
        //        Beware: bug in STM32CubeMX can set it to
        //        use Events (GPIO_MODE_EVT_FALLING) rather
        //        than HW interruptes (GPIO_MODE_IT_FALLING)
        //---------------------------------------------------------
    GPIO_InitStruct.Pin   = GPIO_PIN_3;
    GPIO_InitStruct.Mode  = GPIO_MODE_IT_FALLING;
    GPIO_InitStruct.Pull  = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    HAL_GPIO_Init (GPIOB, &GPIO_InitStruct);

        //--------------------------------------------
        // EXTI interrupt init for PB3 (CC3000_IRQ)
        //--------------------------------------------
    HAL_NVIC_SetPriority (EXTI3_IRQn, 0, 0);
/// HAL_NVIC_EnableIRQ (EXTI3_IRQn); // Let CC3000 logic call WlanInterruptEnable()
#endif         // defined(USES_CC3000) || defined(USES_CC3100) || defined(USES_CC3200)

}


/*******************************************************************************
*  board GPIO pin config
*
*        Configure an individual GPIO pin
*******************************************************************************/
void  board_gpio_pin_config (int gpio_port_num, unsigned long gp_pin,
                             int dir,  int pull)
{
    GPIO_InitTypeDef   GPIO_InitStruct;
    GPIO_TypeDef       *gpio_port;

    gpio_port = (GPIO_TypeDef*) _g_gpio_base [gpio_port_num];

    GPIO_InitStruct.Pin = gp_pin;
    if (dir == GPIO_OUTPUT)
       GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;     // GPIO Output
       else GPIO_InitStruct.Mode = GPIO_MODE_INPUT;    // GPIO Input
    GPIO_InitStruct.Alternate = 0;
    if (pull == GPIO_PULLUP)
       GPIO_InitStruct.Pull = GPIO_PULLUP;
       else if (pull == GPIO_PULLDOWN)
               GPIO_InitStruct.Pull = GPIO_PULLDOWN;
               else GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;

    HAL_GPIO_Init (gpio_port, &GPIO_InitStruct);        // Setup GPIO pin
}


/*******************************************************************************
*  board_gpio_read_pins
*
*        Read in the pins from a GPIO port.  Desired pins are passed via mask.
*        If flag = 0 = read input port.
*        If flag = 1 = read output port.
*******************************************************************************/

uint16_t  board_gpio_read_pins (int gpio_port_num, uint16_t pins_mask, int flag)
{
    GPIO_TypeDef  *gpio_port;
    uint16_t      port_values;

//  if (gpio_port_num < 1 || gpio_port_num > MAX_GPIO_PORTS)
//     return (0xFFFF);                               // denote error

    gpio_port = (GPIO_TypeDef*) _g_gpio_base [gpio_port_num];

    if ( ! flag)
       port_values = gpio_port->IDR & (pins_mask);      // get INPUT port pins
       else port_values = gpio_port->ODR & (pins_mask); // get OUTPUT port pins

    return (port_values);
}


/*******************************************************************************
*  board_irq_pin_config
*
*        Configure an individual GPIO pin to support incoming Interrupt requests
*******************************************************************************/
void  board_irq_pin_config (int gpio_port_num,  unsigned long gp_pin,
                            int rise_fall, int pullup, uint32_t irq_vector_num,
                            unsigned long priority)

{
    GPIO_InitTypeDef   GPIO_InitStruct;
    GPIO_TypeDef       *gpio_port;

    gpio_port = (GPIO_TypeDef*) _g_gpio_base [gpio_port_num];

    GPIO_InitStruct.Pin  = gp_pin;
    if (rise_fall == GPIO_RUPT_MODE_RISING)
       GPIO_InitStruct.Mode = GPIO_MODE_IT_RISING; // GPIO Rising Input triggers
       else if (rise_fall == GPIO_RUPT_MODE_FALLING)
            GPIO_InitStruct.Mode = GPIO_MODE_IT_FALLING; //Falling Input trigger
    GPIO_InitStruct.Alternate = 0;
    if (pullup == GPIO_PULLUP)
       GPIO_InitStruct.Pull = GPIO_PULLUP;               // Engage pullups
       else if (pullup == GPIO_PULLDOWN)
               GPIO_InitStruct.Pull = GPIO_PULLDOWN;     // Engage pulldowns
               else GPIO_InitStruct.Pull = GPIO_NOPULL;  // Disengage pullups
    GPIO_InitStruct.Speed = GPIO_SPEED_FAST;
    HAL_GPIO_Init (gpio_port, &GPIO_InitStruct);         // Setup GPIO pin

        // Configure the NVIC for the Interrupt coming from the BlueNRG shield
    HAL_NVIC_SetPriority (irq_vector_num, priority, 0);

        // Model TI's support, and avoid any "early interrupts" that
        // ISR may not be expecting (e.g. CC3100 Simplelink)   04/20/15 change
    HAL_NVIC_DisableIRQ (irq_vector_num);
}


/*******************************************************************************
*  board_irq_pin_enable
*
*        Enable the GPIO pin for an incoming interrupt
*******************************************************************************/
void  board_irq_pin_enable (int gpio_port_num,  unsigned long pin,
                            uint32_t irq_vector_num, int clear_pending)
{
    GPIO_TypeDef       *gpio_port;

    gpio_port = (GPIO_TypeDef*) _g_gpio_base [gpio_port_num];

    if (clear_pending)
       HAL_NVIC_ClearPendingIRQ (irq_vector_num);//clear any previous interrupts
    HAL_NVIC_EnableIRQ (irq_vector_num);
}


#if defined(USES_I2C)
//*****************************************************************************
//*****************************************************************************
//                               I2C   Routines
//*****************************************************************************
//*****************************************************************************

   //  need to supply for STM32  F4

#endif                                   // USES_I2C



//*****************************************************************************
//*****************************************************************************
//                               SPI   Routines
//*****************************************************************************
//*****************************************************************************

