GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
/*******************************************************************************
* board spi init function          was   SPI2_Init
*
*         Configures this MCU's SPI peripheral and its associated GPIOs.
*
*                SCLK     MISO     MOSI
*                ----     ----     ----
*         SPI1 = PA5   /  PA6   /  PA7
*           "    PB3   /  PB4   /  PB5    (alternate pin mode)
*         SPI2 = PB13  /  PC2   /  PC3
*           "    PB13  /  PB14  /  PB15   (alternate pin mode)
*         SPI3 = PC10  /  PC11  /  PC12
*           "    PB3   /  PB4   /  PB5    (alternate pin mode)
*******************************************************************************/
    GPIO_InitTypeDef   GPIO_InitStruct;

SPI_HandleTypeDef  *board_spi_init (int spi_module_id,  int _g_spi_mode,
                                    int baud_rate_scalar,  int use_dma)
{
    SPI_HandleTypeDef  *phspi;
    int                rc;
    GPIO_InitTypeDef   GPIO_InitStruct;

                                  /* Definition for SPIx clock resources */
#define DMAx_CLK_ENABLE()                __HAL_RCC_DMA1_CLK_ENABLE()
/* Definition for SPIx's DMA */
#define SPIx_TX_DMA_CHANNEL              DMA_CHANNEL_0
#define SPIx_TX_DMA_STREAM               DMA1_Stream4
#define SPIx_RX_DMA_CHANNEL              DMA_CHANNEL_0
#define SPIx_RX_DMA_STREAM               DMA1_Stream3

/* Definition for SPIx's NVIC */
#define SPIx_DMA_TX_IRQn                 DMA1_Stream4_IRQn
#define SPIx_DMA_RX_IRQn                 DMA1_Stream3_IRQn
#define SPIx_DMA_TX_IRQHandler           DMA1_Stream4_IRQHandler
#define SPIx_DMA_RX_IRQHandler           DMA1_Stream3_IRQHandler


#if defined(USE_DMA)
  static DMA_HandleTypeDef hdma_tx;
  static DMA_HandleTypeDef hdma_rx;
  DMAx_CLK_ENABLE();

  /* Configure the DMA handler for Transmission process */
  hdma_tx.Instance                 = SPIx_TX_DMA_STREAM;

  hdma_tx.Init.Channel             = SPIx_TX_DMA_CHANNEL;
  hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
  hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_tx.Init.Mode                = DMA_NORMAL;
  hdma_tx.Init.Priority            = DMA_PRIORITY_LOW;
  hdma_tx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  hdma_tx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_tx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_tx.Init.PeriphBurst         = DMA_PBURST_INC4;

  HAL_DMA_Init (&hdma_tx);

      /* Associate the initialized DMA handle to the the SPI handle */
  __HAL_LINKDMA (hspi, hdmatx, hdma_tx);

      /* Configure the DMA handler for Transmission process */
  hdma_rx.Instance                 = SPIx_RX_DMA_STREAM;

  hdma_rx.Init.Channel             = SPIx_RX_DMA_CHANNEL;
  hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
  hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
  hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
  hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
  hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
  hdma_rx.Init.Mode                = DMA_NORMAL;
  hdma_rx.Init.Priority            = DMA_PRIORITY_HIGH;
  hdma_rx.Init.FIFOMode            = DMA_FIFOMODE_DISABLE;
  hdma_rx.Init.FIFOThreshold       = DMA_FIFO_THRESHOLD_FULL;
  hdma_rx.Init.MemBurst            = DMA_MBURST_INC4;
  hdma_rx.Init.PeriphBurst         = DMA_PBURST_INC4;

  HAL_DMA_Init (&hdma_rx);

      /* Associate the initialized DMA handle to the the SPI handle */
  __HAL_LINKDMA (hspi, hdmarx, hdma_rx);

      /*##-4- Configure the NVIC for DMA #########################################*/
      /* NVIC configuration for DMA transfer complete interrupt (SPI3_TX) */
  HAL_NVIC_SetPriority (SPIx_DMA_TX_IRQn, 0, 1);
  HAL_NVIC_EnableIRQ (SPIx_DMA_TX_IRQn);

      /* NVIC configuration for DMA transfer complete interrupt (SPI3_RX) */
  HAL_NVIC_SetPriority (SPIx_DMA_RX_IRQn, 0, 0);
  HAL_NVIC_EnableIRQ (SPIx_DMA_RX_IRQn);
#endif                                        //  #if defined(USE_DMA)

#if defined(USE_DMA)
              //------------------------------------------
              // DMA init for SPI RX and TX directions
              //------------------------------------------
           _g_hdma_spi2_rx.Instance                 = DMA1_Channel4;    // RX
           _g_hdma_spi2_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
           _g_hdma_spi2_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
           _g_hdma_spi2_rx.Init.MemInc              = DMA_MINC_DISABLE; // ISSUE ???
           _g_hdma_spi2_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
           _g_hdma_spi2_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
           _g_hdma_spi2_rx.Init.Mode                = DMA_NORMAL;
           _g_hdma_spi2_rx.Init.Priority            = DMA_PRIORITY_MEDIUM;
           HAL_DMA_Init (&_g_hdma_spi2_rx);

           __HAL_LINKDMA (&_g_hspi2, hdmarx, _g_hdma_spi2_rx);

           _g_hdma_spi2_tx.Instance                 = DMA1_Channel5;  // TX
           _g_hdma_spi2_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
           _g_hdma_spi2_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
           _g_hdma_spi2_tx.Init.MemInc              = DMA_MINC_ENABLE;
           _g_hdma_spi2_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;
           _g_hdma_spi2_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_BYTE;
           _g_hdma_spi2_tx.Init.Mode                = DMA_NORMAL;
           _g_hdma_spi2_tx.Init.Priority            = DMA_PRIORITY_MEDIUM;
           HAL_DMA_Init (&_g_hdma_spi2_tx);

           __HAL_LINKDMA (&_g_hspi2, hdmatx, _g_hdma_spi2_tx);
#endif                            // defined(USE_DMA)

         //--------------------------------------------------------------
         // This is a little bit overkill, but it handles all current
         // SPI variations of supported X-Nucleo boards. In most cases
         // this allows many diffrent combinations of stacked X-Nucleo
         // boards (subject to resolving CS conflicts, etc).
         //--------------------------------------------------------------

    switch (spi_module_id)             // STM32  F401RE  SPI   Support
      {
       case SPI_ID_1_A:                // SPI 1 A    uses pins PA5/PA6/PA7
                                       // Typically used by L6474 Stepper shield
               __SPI1_CLK_ENABLE();    // Ensure SPI peripheral clock turned on
               phspi = &_g_hspi1;         // point at associated SPI "Handle"
               phspi->Instance = SPI1; //    and set associated SPI module
               _g_hspi1_type = SPI_ID_1_A;
                    // SPI 1 A uses GPIO pins PA5/PA6/PA7.
                    // Set them to SPI Alt Function
               GPIO_InitStruct.Pin       = SPI_1_A_SCLK_PIN;
               GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
               GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
               GPIO_InitStruct.Pull      = SPI_1_A_SCLK_PULL_MODE;
               GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
               HAL_GPIO_Init (GPIOA, &GPIO_InitStruct);     // Setup PA5 SPI pin
               GPIO_InitStruct.Pin       = SPI_1_A_MISO_PIN | SPI_1_A_MOSI_PIN;
               GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
               GPIO_InitStruct.Pull      = SPI_1_A_MOSx_PULL_MODE;
               HAL_GPIO_Init (GPIOA, &GPIO_InitStruct); //Setup PA6/PA7 SPI pins
               break;

       case SPI_ID_1_B:                // SPI 1 B    uses pins PB3/PA6/PA7
                                       // Typically used by Blue_NRG BLE shield
               __SPI1_CLK_ENABLE();    // Ensure SPI peripheral clock turned on
#if (USES_BLUENRG_BLE)
               phspi = &SpiHandle;   // point at BlueNRG's required SPI "Handle"
#else
               phspi = &_g_hspi1;       // point at our associated SPI "Handle"
#endif
               phspi->Instance = SPI1; //    and set associated SPI module
               _g_hspi1_type = SPI_ID_1_B;
                    // SPI 1 B uses GPIO pins PB3/PA6/PA7.
                    // Set them to SPI Alt Function
               GPIO_InitStruct.Pin       = SPI_1_B_SCLK_PIN;
               GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
               GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
               GPIO_InitStruct.Pull      = SPI_1_B_SCLK_PULL_MODE; // ST logic !
               GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
               HAL_GPIO_Init (GPIOB, &GPIO_InitStruct);    // Setup PB3 SPI pin
               GPIO_InitStruct.Pin       = SPI_1_B_MISO_PIN | SPI_1_B_MOSI_PIN;
               GPIO_InitStruct.Pull      = SPI_1_B_MOSx_PULL_MODE; // ST logic !
               GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
               HAL_GPIO_Init (GPIOA, &GPIO_InitStruct); //Setup PA6/PA7 SPI pins
               break;

       case SPI_ID_2_C:                // SPI 2 C    uses pins PB13/PC2/PC3
               __SPI2_CLK_ENABLE();    // Ensure SPI peripheral clock turned on
               phspi = &_g_hspi2;         // point at associated SPI "Handle"
               phspi->Instance = SPI2; //    and set associated SPI module
               _g_hspi2_type = SPI_ID_2_C;
                    // SPI 2 C uses GPIO pins PB13/PC2/PC3.
                    // Set them to SPI Alt Function
               GPIO_InitStruct.Pin       = SPI_2_C_SCLK_PIN;
               GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
               GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
               GPIO_InitStruct.Pull      = SPI_2_C_SCLK_PULL_MODE;
               GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
               HAL_GPIO_Init (GPIOB, &GPIO_InitStruct);    // Setup PB13 SPI pin
               GPIO_InitStruct.Pin       = SPI_2_C_MISO_PIN | SPI_2_C_MOSI_PIN;
               GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
               GPIO_InitStruct.Pull      = SPI_2_C_MOSx_PULL_MODE;
               HAL_GPIO_Init (GPIOC, &GPIO_InitStruct); //Setup PC2/PC3 SPI pins
#if defined(USE_DMA)
                   //----------------------------------------
                   //    SPI2  Interrupts  Enable
                   //----------------------------------------
               board_spi_dma_init();
               HAL_NVIC_SetPriority (SPI2_IRQn, 0, 0);
               HAL_NVIC_EnableIRQ (SPI2_IRQn);
#endif
               break;

       case SPI_ID_3_C:               // SPI 3 C    uses pins PC10/PC11/PC12
                                      // Typically used by W5200 Ethernet shield
               __SPI3_CLK_ENABLE();    // Ensure SPI peripheral clock turned on
               phspi = &_g_hspi3;         // point at associated SPI "Handle"
               phspi->Instance = SPI3; //    and set associated SPI module
               _g_hspi3_type = SPI_ID_3_C;
                    // SPI 3 C uses GPIO pins PC10/PC11/PC12.
                    // Set them to SPI Alt Function
               GPIO_InitStruct.Pin       = SPI_3_C_SCLK_PIN;
               GPIO_InitStruct.Mode      = GPIO_MODE_AF_PP;
               GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
               GPIO_InitStruct.Pull      = SPI_3_C_SCLK_PULL_MODE;
               GPIO_InitStruct.Speed     = GPIO_SPEED_FAST;
               HAL_GPIO_Init (GPIOC, &GPIO_InitStruct);  // Setup PC10/ SPI pin
               GPIO_InitStruct.Pin       = SPI_3_C_MISO_PIN | SPI_3_C_MOSI_PIN;
               GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
               GPIO_InitStruct.Pull      = SPI_3_C_MOSx_PULL_MODE;
               HAL_GPIO_Init (GPIOC, &GPIO_InitStruct);  // Setup PC11/PC12 SPI
               break;
      }
         //------------------------------------------------------------
         //              Setup rest of SPI Configuration
         //------------------------------------------------------------
    phspi->Init.Mode            = SPI_MODE_MASTER;
    phspi->Init.Direction       = SPI_DIRECTION_2LINES;
    phspi->Init.DataSize        = SPI_DATASIZE_8BIT;
    if (_g_spi_mode == 0)
      { phspi->Init.CLKPolarity = SPI_POLARITY_LOW;
        phspi->Init.CLKPhase    = SPI_PHASE_1EDGE;
      }
     else if (_g_spi_mode == 1)
      { phspi->Init.CLKPolarity = SPI_POLARITY_HIGH;
        phspi->Init.CLKPhase    = SPI_PHASE_1EDGE;
      }
     else if (_g_spi_mode == 2)
      { phspi->Init.CLKPolarity = SPI_POLARITY_LOW;  // CPOL = 0, CPHA = 1
        phspi->Init.CLKPhase    = SPI_PHASE_2EDGE;
      }
     else if (_g_spi_mode == 3)
      { phspi->Init.CLKPolarity = SPI_POLARITY_HIGH; //EASY_SPIN, PRESCALE = 32
        phspi->Init.CLKPhase    = SPI_PHASE_2EDGE;   //Ada ST7735 LCD SCALE = 8
      }
    phspi->Init.NSS             = SPI_NSS_SOFT;
    phspi->Init.FirstBit        = SPI_FIRSTBIT_MSB;
    phspi->Init.CRCCalculation  = SPI_CRCCALCULATION_DISABLED;
    phspi->Init.CRCPolynomial   = 7;
    phspi->Init.TIMode          = SPI_TIMODE_DISABLED;
//  phspi->Init.NSSPMode        = SPI_NSS_Soft;          // WVD CHange 03/11/15

       // PCLK2 max frequency is 100 MHz.  BAUD = PCLK2/SPI_BaudRatePrescaler.
    phspi->Init.BaudRatePrescaler = baud_rate_scalar;

    HAL_SPI_Init (phspi);

// UNTIL CONVERT ALL ST CODE OVER, YOU MUST ALSO INITIALIZE THEIR SpiHandle
// struct WHICH THEIR CODE USES.  ELSE, SPI GOES OUT TO LUNCH.
//     3.5+ HOUR PAINFUL LESSON.
// memcpy (&SpiHandle, phspi, sizeof(SpiHandle));
// HAL_SPI_Init (&SpiHandle);

