GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    __HAL_SPI_ENABLE (phspi);

    return (phspi);      // return ptr to SPI module that will be used for
                         // caller's SPI device I/O
}


/*******************************************************************************
* Enable DMA controller clock and initialize DMA Interrupts
*******************************************************************************/
void  board_spi_dma_init (void)
{
#if defined(DMA_ENABLED)
    __DMA1_CLK_ENABLE();               // DMA controller clock enable

        //--------------------------------------------
        //    DMA interrupts init
        //--------------------------------------------
    HAL_NVIC_SetPriority (DMA1_Channel4_IRQn, 0, 0);   // SPI RX
    HAL_NVIC_EnableIRQ (DMA1_Channel4_IRQn);
    HAL_NVIC_SetPriority (DMA1_Channel5_IRQn, 0, 0);   // SPI TX
    HAL_NVIC_EnableIRQ (DMA1_Channel5_IRQn);
#endif
}



//*****************************************************************************
//*****************************************************************************
//                       System CPU / Systick   Routines
//*****************************************************************************
//*****************************************************************************

//*****************************************************************************
//  board_stop_WDT
//*****************************************************************************

void board_stop_WDT (void)
{
      // chip default is it comes up with WWDG and IWDG in reset state
      // This is done in SystemInit(), which is part of the CMSIS startup logic.
}


/*******************************************************************************
* System Clock Configuration
*
*         System Clock is configured as follows:
*            System Clock source            = PLL (HSI)
*            SYSCLK(Hz)                     = 100000000       (100 MHz)
*            HCLK(Hz)                       = 100000000
*            AHB Prescaler                  = 1
*            APB1 Prescaler                 = 2
*            APB2 Prescaler                 = 1
*            HSI Frequency(Hz)              = 16000000
*            PLL_M                          = 16
*            PLL_N                          = 400
*            PLL_P                          = 4
*            PLL_Q                          = 7
*            VDD(V)                         = 3.3
*            Main regulator output voltage  = Scale2 mode
*            Flash Latency(WS)              = 3
*******************************************************************************/
void  board_system_clock_config (long  mcu_clock_hz)
{
    RCC_ClkInitTypeDef  RCC_ClkInitStruct;
    RCC_OscInitTypeDef  RCC_OscInitStruct;

       /* Enable Power Control clock */
    __HAL_RCC_PWR_CLK_ENABLE();

       /* The voltage scaling allows optimizing power consumption when device
       ** is clocked below the maximum system frequency, to update the voltage
       ** scaling value regarding system frequency refer to product datasheet.*/
    __HAL_PWR_VOLTAGESCALING_CONFIG (PWR_REGULATOR_VOLTAGE_SCALE1);

    if (mcu_clock_hz == 0)
       _g_SysClk_Ticks = MCU_CLOCK_SPEED;    // use default clock rate = 72 MHz
       else _g_SysClk_Ticks = mcu_clock_hz;

        /* Enable HSI Oscillator and activate PLL with HSI as source */
    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
    RCC_OscInitStruct.HSIState       = RCC_HSI_ON;
    RCC_OscInitStruct.HSICalibrationValue = 0x10;          // BLE uses 6
    RCC_OscInitStruct.PLL.PLLState   = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource  = RCC_PLLSOURCE_HSI;
    RCC_OscInitStruct.PLL.PLLM       = 16;
    RCC_OscInitStruct.PLL.PLLN       = 400;                // BLE uses 256
    RCC_OscInitStruct.PLL.PLLP       = RCC_PLLP_DIV4;      // BLE uses DIV8
    RCC_OscInitStruct.PLL.PLLQ       = 7;                  // BLE uses 4
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
       {
         board_error_handler();
       }

        /* Select PLL as system clock source and configure the HCLK,
        ** PCLK1 and PCLK2 clock dividers */
    RCC_ClkInitStruct.ClockType      = (RCC_CLOCKTYPE_SYSCLK
                                      | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1
                                      | RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStruct.SYSCLKSource   = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider  = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;
    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_3) != HAL_OK)
       {
         board_error_handler();
       }

/// _g_SysClk_Ticks = MCLK_MHz * 1000000;   // save MCU clock frequency in ticks
}


//*****************************************************************************
//  board_system_clock_get_frequency
//
//       Return the board's MCU clock frequency in ticks. (usually = MHz value)
//*****************************************************************************

long  board_system_clock_get_frequency (void)
{
    return (_g_SysClk_Ticks);     // return the MCU clock frequency in ticks
}


//*****************************************************************************
//  board_sys_IO_clock_get_frequency
//
//       Return the board's Peripheral IO clock frequency in ticks.
//       On STM32, we set I/O clock to same rate as MCU clock.
//*****************************************************************************

long  board_sys_IO_clock_get_frequency (void)
{
    return (_g_SysClk_Ticks);     // return the I/O clock frequency in ticks
}


//*****************************************************************************
// board_systick_timer_config
//
//          Provide a "SYSTICK" style Interval Timer.
//
//*****************************************************************************
void  board_systick_timer_config (void)
{
     // Nothing to do here, because HAL_Init() automatically starts
     // up the SysteickTimer with a 1 milli-second period
}


//*****************************************************************************
// board_systick_timer_get_value
//
//            Get the current value of the "SYSTICK" style Interval Timer.
//            It returns a unsigned long of how many millseconds have
//            elapsed since the board started up.
//*****************************************************************************
unsigned long  board_systick_timer_get_value (void)
{
    return (_g_systick_millisecs);
}


//*****************************************************************************
//                                HAL_GetTick
//
//            Get the current value of the "SYSTICK" style Interval Timer.
//
//THIS OVERRIDEs the DEFAULT STM32 HAL Systick function weak in stm32f0xxx_hal.c
//*****************************************************************************

uint32_t  HAL_GetTick (void)
{
    return (_g_systick_millisecs);
}


//*****************************************************************************
//                                HAL_IncTick
//
// SysTick interrupt handler.
// Directly called from Systick ISR !
//
//                               Increment Systick 1 ms count, on every 1ms pop
//
//THIS OVERRIDEs the DEFAULT STM32 HAL Systick function weak in stm32f0xxx_hal.c
//*****************************************************************************
void  HAL_IncTick (void)
{
    _g_systick_millisecs++;  // inc Systick counter (add 1 for each 1 ms rupt)

#if defined(USES_MQTT)
    extern  unsigned long    MilliTimer;
    MilliTimer++;            // update MQTTCC3100.c's associated Timer
/// SysTickIntHandler();     // invoke MQTTCC3100.c to update its Timer
#endif

#if defined(USES_VTIMER)
    if (_g_vtimers_active > 0)
       board_vtimer_check_expiration (_g_systick_millisecs);
#endif
}



//#if defined(USES_PWM) || defined(USES_TIMER) || defined(USES_DAC) || defined(USES_ADC)

//*****************************************************************************
//*****************************************************************************
//               REAL  TIMER / PWM   Support           Physical Timers on chip
//*****************************************************************************
//*****************************************************************************

//*****************************************************************************
//*****************************************************************************
//             COMMON   TIMER  and  PWM   GPIO  PIN   DEFINITIONS
//
//                                for
//
//                       PWM   and   OC/IC   Timers
//*****************************************************************************
//*****************************************************************************
//
//   These GPIO definitions for TIMx_CHx GPIO mappings are used in common by
//   the PWM logic when setting up PWM outputs, and by the Timer Output Compare
//   and Input Capture functions that use GPIOs.
//
//------------------------------------------------------------------------------
//                    Timer / PWM Summary     available on STM32 F0
//                                                                  Supports
//  PWM Timer  Num CCRs   Complementary    DMA     Up/Down/Center     PWM
//    TIM1        4           Yes           Yes       All             Yes
//    TIM2        4           No            Yes       All             Yes
//    TIM3        4           No            Yes       All             Yes
//    TIM4        4           No            Yes       All             Yes
//    TIM5        4           No            Yes       All             Yes
//    TIM9        2           No            No        Up only         Yes
//    TIM10       1           No            No        Up only         Yes
//    TIM11       1           No            No        Up only         Yes
//------------------------------------------------------------------------------

#define  MAX_TIMER        TIMER_11

