GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
#define  TMRPWM_NUM_MODULES    11    // We allow a range of 1 to 11 for Timer
                                    // module Ids, but not all modules are
                                    // enabled or present. This just specifies
                                    // the max size of the array. Timer modules
                                    // not present will have a value of 0 and be
                                    // rejected if the user tries to invoke.
#define  TMPWM_MAX_CHANNELS    4    // are max 4 channels per PWM module

              // flags for _g_pwm_module_status[] entries
#define  TMR_PWM_NORMAL_INIT      0x01  /* Module setup for normal output mode*/
#define  TMR_PWM_COMPLEMENT_INIT  0x08  /* Module setup for Complementary mode*/
#define  TMR_PWM_INTERRUPTS_USED  0x40  /* Module uses Timer interrupts */

              // flags for _g_tmpwm_channels_config[] entries
#define  TMR_USING_PWM_MODE       0x80        /* module is using PWM          */
#define  TMR_CCR3N_CONFIGURED     0x40        /* Comple channel 3N configured */
#define  TMR_CCR2N_CONFIGURED     0x20        /* Comple channel 2N configured */
#define  TMR_CCR1N_CONFIGURED     0x10        /* Comple channel 1N configured */
#define  TMR_CCR4_CONFIGURED      0x08        /* Channel 4 configured for use */
#define  TMR_CCR3_CONFIGURED      0x04        /* Channel 3 configured for use */
#define  TMR_CCR2_CONFIGURED      0x02        /* Channel 2 configured for use */
#define  TMR_CCR1_CONFIGURED      0x01        /* Channel 1 configured for use */

                           // TIMx handles needed, one per module
    TIM_HandleTypeDef  _g_TIM1_TimPwmHandle;   // Timer/PWM  handle for TIM1
    TIM_HandleTypeDef  _g_TIM2_TimPwmHandle;   // Timer/PWM  handle for TIM2
    TIM_HandleTypeDef  _g_TIM3_TimPwmHandle;   // Timer/PWM  handle for TIM3
    TIM_HandleTypeDef  _g_TIM4_TimPwmHandle;   // Timer/PWM  handle for TIM4
    TIM_HandleTypeDef  _g_TIM5_TimPwmHandle;   // Timer/PWM  handle for TIM5
    TIM_HandleTypeDef  _g_TIM9_TimPwmHandle;   // Timer/PWM  handle for TIM9
    TIM_HandleTypeDef  _g_TIM10_TimPwmHandle;  // Timer/PWM  handle for TIM10
    TIM_HandleTypeDef  _g_TIM11_TimPwmHandle;  // Timer/PWM  handle for TIM11

                           // Bit mask status of each Timer Module (initialized, ...)
    char               _g_tmpwm_module_status [TMRPWM_NUM_MODULES+1] = { 0,0,0,0,0,0 };

                           // Bit Mask status of CCRs in each module (enabled, PWM, ...)
                           // One entry per timer module.
    unsigned char      _g_tmpwm_channels_config [TMRPWM_NUM_MODULES+1] = { 0,0,0,0,0,0,0,0 };

                           // Bit Mask PWM status of CCRs in each module (Normal, Complementary,...)
                           // One entry per timer module.
    unsigned char      _g_tmpwm_channels_pwm [TMRPWM_NUM_MODULES+1] = { 0,0,0,0,0 };

                           // Bit mask of which CCRs are using interrupts in each module.
                           // One entry per timer module.
    uint16_t           _g_timer_app_enabled_interrupts [TMRPWM_NUM_MODULES+1] = { 0,0,0,0,0,0 };

                           // Interrupt Callback addresses. One entry per timer module.
 TMR_CB_EVENT_HANDLER  _g_ptimer_callback [TMRPWM_NUM_MODULES+1] = { 0,0,0,0,0,0,0,0,0,0 };
    void               *_g_ptimer_callback_parm [TMRPWM_NUM_MODULES+1];

                           // Timer Prescalars used for each Timer module.
    uint32_t           _g_tmpwm_prescalars [TMRPWM_NUM_MODULES+1]    = { 0,0,0,0,0,0 };

        //----------------------------------------------------------------------
        //     Global constants and Tables used to manage Timer/PWM Logic
        //----------------------------------------------------------------------

const unsigned char    _g_pwm_chan_mask [8]     // Bit masks used to track if a channel
                                                // is enabled and/or using COMPLE
                                  = {      0,         /* Channel 0 is unused */
                                      TMR_CCR1_CONFIGURED,  /* Channels 1-4 */
                                      TMR_CCR2_CONFIGURED,  /*   0x02  */
                                      TMR_CCR3_CONFIGURED,  /*   0x04  */
                                      TMR_CCR4_CONFIGURED,  /*   0x08  */
                                      TMR_CCR1N_CONFIGURED, /* Channels 1N-3N */
                                      TMR_CCR2N_CONFIGURED, /*   0x20  */
                                      TMR_CCR3N_CONFIGURED  /*   0x40  */
                                    };                      // there is no 4N

                             //-------------------------------------------------------
                             // List of HAL constants to specify interrupt mask for a CCR
                             //-------------------------------------------------------
const unsigned char    _g_tmpwm_CCR_rupt_flags [5]
                                  = { TIM_SR_UIF,        /* CCR0 aka Rollover */
                                      TIM_SR_CC1IF,      /* CCR1 interrupt    */
                                      TIM_SR_CC2IF,      /* CCR2 interrupt    */
                                      TIM_SR_CC3IF,      /* CCR3 interrupt    */
                                      TIM_SR_CC4IF       /* CCR4 interrupt    */
                                    };

                             //-------------------------------------------------------
                             // List of constants used by HAL to identify CCR channels
                             //-------------------------------------------------------
const unsigned int     _g_timer_channel_id [5]
                                   = { 0,       // unused
                                       TIM_CHANNEL_1,       /* 0x0000 */
                                       TIM_CHANNEL_2,       /* 0x0004 */
                                       TIM_CHANNEL_3,       /* 0x0008 */
                                       TIM_CHANNEL_4        /* 0x000C */
                                     };

                             //-------------------------------------------------
                             //  List of Physical Base Address of TIMx registers
                             //-------------------------------------------------
const TIM_TypeDef      *_g_timer_module_base []   /* Register base address */
                                = { 0L,                    // no TIM0  on F4
                                    TIM1,  // full, w/deadtime, w/complementary,
                                    TIM2,  // no dead time, no complementary
                                    TIM3,  //   ditto       (servos, encoders)
                                    TIM4,  //   ditto
                                    TIM5,  //   ditto
                                    0L,                    // no TIM6  on F4
                                    0L,                    // no TIM7  on F4
                                    0L,                    // no TIM8  on F4
                                    TIM9,  //   ditto
                                    TIM10, //   ditto
                                    TIM11  //   ditto      last valid timer on F4
                                  };

                             //----------------------------------------------------------
                             //  List of HAL Handle Address for each separate TIM Handle
                             //----------------------------------------------------------
const TIM_HandleTypeDef *_g_timer_module_handle [] /* HAL API Handles */
                                = { 0L,                     // no TIM0  on F4
                                    (TIM_HandleTypeDef*) &_g_TIM1_TimPwmHandle,  // TIM1
                                    (TIM_HandleTypeDef*) &_g_TIM2_TimPwmHandle,  // TIM2
                                    (TIM_HandleTypeDef*) &_g_TIM3_TimPwmHandle,  // TIM3
                                    (TIM_HandleTypeDef*) &_g_TIM4_TimPwmHandle,  // TIM4
                                    (TIM_HandleTypeDef*) &_g_TIM5_TimPwmHandle,  // TIM5
                                    (TIM_HandleTypeDef*) 0L,                     // no TIM6  on F4
                                    (TIM_HandleTypeDef*) 0L,                     // no TIM7  on F4
                                    (TIM_HandleTypeDef*) 0L,                     // no TIM8  on F4
                                    (TIM_HandleTypeDef*) &_g_TIM9_TimPwmHandle,  // TIM9
                                    (TIM_HandleTypeDef*) &_g_TIM10_TimPwmHandle, // TIM10
                                    (TIM_HandleTypeDef*) &_g_TIM11_TimPwmHandle  // TIM11 - last valid timer on F4
                                  };

                             //----------------------------------------------------------
                             // _g_TMPWM_IRQ_table
                             //
                             //     Table of IRQ numbers used to setup the associated
                             //     NVIC interrupt enable for a specific timer.
                             //----------------------------------------------------------
const unsigned char    _g_TMPWM_IRQ_table []
                                = { 0,              //  0 is not valid
                                    TIM1_CC_IRQn,   //  TIMER_1 CCRs only
                                                    //  Timer 1 updates handled in code (TIM1_TRG_COM_TIM11_IRQn)
                                    TIM2_IRQn,      //  TIMER_2 update and CCRs
                                    TIM3_IRQn,      //  TIMER_3   "     "   "
                                    TIM4_IRQn,      //  TIMER_4
                                    TIM4_IRQn,      //  TIMER_5
                                    0,              //  no TIM6
                                    0,              //  no TIM7
                                    0,              //  no TIM8
                                TIM1_BRK_TIM9_IRQn, //  TIMER_9 update
                                TIM1_UP_TIM10_IRQn, //  TIMER_10 update  -- AND --  SHARED WITH TIM1 Update
                           TIM1_TRG_COM_TIM11_IRQn  //  TIMER_11 update
                                  };

                             //-------------------------------------------------
                             // _g_timer_base_channel_num
                             //
                             //     converts user API logical channel numbers, such as
                             //     TMR_PWM_CHANNEL_1  / TMR_PWM_CHANNEL_1_ALT1 / TMR_PWM_CHANNEL_1_N
                             //     which are used to denote which Pin-Mux setting to
                             //     use for outputs that can be routed to different pins.
                             //
                             //     The _ALT1 / _ALT2 / _N / _N_ALT settings are
                             //     used to select the proper GPIO onto which to
                             //     route the signal.
                             //-------------------------------------------------
const unsigned char    _g_timer_base_channel_num []
                            = {   -1,               //  0 is not valid
                                TIM_CHANNEL_1,      //  1 TMR_PWM_CHANNEL_1
                                TIM_CHANNEL_2,      //  2 TMR_PWM_CHANNEL_2
                                TIM_CHANNEL_3,      //  3 TMR_PWM_CHANNEL_3
                                TIM_CHANNEL_4,      //  4 TMR_PWM_CHANNEL_4
                                  -1,               //  5 unused
                                  -1,               //  6 unused
                                  -1,               //  7 unused
                                TIM_CHANNEL_1,      //  8 TMR_PWM_CHANNEL_1_ALT1
                                TIM_CHANNEL_2,      //  9 TMR_PWM_CHANNEL_2_ALT1
                                TIM_CHANNEL_3,      // 10 TMR_PWM_CHANNEL_3_ALT1
                                TIM_CHANNEL_4,      // 11 TMR_PWM_CHANNEL_4_ALT1
                                TIM_CHANNEL_1,      // 12 TMR_PWM_CHANNEL_1_ALT2
                                TIM_CHANNEL_2,      // 13 TMR_PWM_CHANNEL_2_ALT2
                                TIM_CHANNEL_3,      // 14 TMR_PWM_CHANNEL_3_ALT2
                                TIM_CHANNEL_4,      // 15 TMR_PWM_CHANNEL_4_ALT2
                                TIM_CHANNEL_1,      // 16 TMR_PWM_CHANNEL_1_N
                                TIM_CHANNEL_2,      // 17 TMR_PWM_CHANNEL_2_N
                                TIM_CHANNEL_3,      // 18 TMR_PWM_CHANNEL_3_N
                                  -1,               // 19 unused (no Channel 4N)
                                TIM_CHANNEL_1,      // 20 TMR_PWM_CHANNEL_1_N_ALT1
                                TIM_CHANNEL_2,      // 21 TMR_PWM_CHANNEL_2_N_ALT1
                                TIM_CHANNEL_3,      // 22 TMR_PWM_CHANNEL_3_N_ALT1
                                  -1,               // 23 unused (no Channel 4N)
                                TIM_CHANNEL_1,      // 24 TMR_PWM_CHANNEL_1_N_ALT2
                                TIM_CHANNEL_2,      // 25 TMR_PWM_CHANNEL_2_N_ALT2
                                TIM_CHANNEL_3,      // 26 TMR_PWM_CHANNEL_3_N_ALT2
                              };


               //--------------------------------------------------------------
               //                       GPIO   MAPPING   TABLES
               //
               // These tables contain the GPIO mapping for every GPIO pin that
               // can be used for Input (Input Capture) or Output (PWM or
               // Timer Output Compare) by the Timer/PWM modules.
               //
               // They are also correlated to a Timer Channel number (1,2,3,4)
               // which are in turn controlled by a CCR with the same number,
               // e.g. Timer Channel 1 (ex TIM1_CH1) is controlled by CCR1 on
               // the Timer 1 module; Timer Channel 3 (ex TIM2_CH3) is
               // controlled by CCR3 on the Timer 2 module, etc.
               //
               // A number of channels have alternative pin mappings, e.g.
               // TIM1_CH1 can be routed out to the PA8, PA7, or PB13 pins.
               // When multiple mappings exist, the 2nd and 3rd mappings
               // are distinguished as ALT1 and ALT2 in the user_api.h file
               // board specific entries. E.g. for TIM1_CH1, it would be
               // specified by the user as:
               //       CHANNEL_1           // default = PA8
               //       CHANNEL_1_ALT1      // use  PA7
               //       CHANNEL_1_ALT2      // use  PB13
               // See comments in the API documentation that describe which GPIO
               // pin each alternative is assigned to (e.g. PA8, PA7, or PB13)
               //--------------------------------------------------------------
               // NOTE: Ports D and E are _NOT_ hooked up on F0_72

typedef struct tim_pwm_channel_def     /* TIMER/PWM Channel definitions   */
    {
        GPIO_TypeDef *chan_gpio_port;  /* Associated GPIO port            */
        uint32_t     chan_gpio_pin;    /* Associated GPIO pin             */
        uint8_t      chan_alt_func;    /* Channel Alternate Function Id   */
        uint8_t      user_channel_id;  /* USER API designation: CHANNEL_1, CHANNEL_1_ALT1, ... */
        uint16_t     chan_pwm_id;      /* Chip Channel id for this CCR    */
    } TMPWM_CHANNEL_BLK;


