GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_1_channels [] =                  // TIM1
       { {   0L,      0L,             0,              0,              0       }, // STM32                   Arduino
         { GPIOA, GPIO_PIN_8, GPIO_AF1_TIM1, TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PA8  TIM1_CH1             D7
         { GPIOA, GPIO_PIN_9, GPIO_AF1_TIM1, TMR_PWM_CHANNEL_2, TIM_CHANNEL_2 }, // PA9  TIM1_CH2             D8
         { GPIOA, GPIO_PIN_10,GPIO_AF1_TIM1, TMR_PWM_CHANNEL_3, TIM_CHANNEL_3 }, // PA10 TIM1_CH3             D2
         { GPIOA, GPIO_PIN_11,GPIO_AF1_TIM1, TMR_PWM_CHANNEL_4, TIM_CHANNEL_4 }, // PA11 TIM1_CH4
                     // Complementary pins
         { GPIOA, GPIO_PIN_7, GPIO_AF1_TIM1, TMR_PWM_CHANNEL_1_N, TIM_CHANNEL_1 }, // PA7  TIM1_CH1N            D11   also PB13 TIM1_CH1N
         { GPIOB, GPIO_PIN_0, GPIO_AF1_TIM1, TMR_PWM_CHANNEL_2_N, TIM_CHANNEL_2 }, // PB0  TIM1_CH2N / TIM3_CH3 A3   also PB14 TIM1_CH2N
         { GPIOB, GPIO_PIN_1, GPIO_AF1_TIM1, TMR_PWM_CHANNEL_3_N, TIM_CHANNEL_3 }, // PB1  TIM1_CH3N / TIM3_CH4       also PB15 TIM1_CH3N
      // Alternates
         { GPIOB, GPIO_PIN_13,GPIO_AF1_TIM1, TMR_PWM_CHANNEL_1_N_ALT1, TIM_CHANNEL_1 }, // PB13 TIM1_CH1N            D11   also PB13 TIM1_CH1N
         { GPIOB, GPIO_PIN_14,GPIO_AF1_TIM1, TMR_PWM_CHANNEL_2_N_ALT1, TIM_CHANNEL_2 }, // PB14 TIM1_CH2N / TIM3_CH3 A3   also PB14 TIM1_CH2N
         { GPIOB, GPIO_PIN_15,GPIO_AF1_TIM1, TMR_PWM_CHANNEL_3_N_ALT1, TIM_CHANNEL_3 }, // PB15 TIM1_CH3N / TIM3_CH4       also PB15 TIM1_CH3N
         { 0,          0,             0,              0,              0              }  // end of table
       };

const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_2_channels [] =                  // TIM2
       { {    0L,      0L,             0,           0,             0         },  // STM32                    Arduino
         { GPIOA, GPIO_PIN_0, GPIO_AF1_TIM2, TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PA0  TIM2_CH1 / TIM5_CH1  A0    also PA5 TIM2_CH1  also PA15 TIM2_CH1
         { GPIOA, GPIO_PIN_1, GPIO_AF1_TIM2, TMR_PWM_CHANNEL_2, TIM_CHANNEL_2 }, // PA1  TIM2_CH2 / TIM5_CH2  A1    also PB3 TIM2_CH2
         { GPIOA, GPIO_PIN_2, GPIO_AF1_TIM2, TMR_PWM_CHANNEL_3, TIM_CHANNEL_3 }, // PA2  TIM2_CH3 / TIM5_CH3  D1    also PB10 TIM2_CH3
         { GPIOA, GPIO_PIN_3, GPIO_AF1_TIM2, TMR_PWM_CHANNEL_4, TIM_CHANNEL_4 }, // PA3  TIM2_CH4 / TIM5_CH4  D0
     // Alternates
         { GPIOA, GPIO_PIN_5, GPIO_AF1_TIM2, TMR_PWM_CHANNEL_1_ALT1, TIM_CHANNEL_1 }, // PA5  TIM2_CH1 / TIM5_CH2  A1    also PB3 TIM2_CH2
         { GPIOB, GPIO_PIN_3, GPIO_AF1_TIM2, TMR_PWM_CHANNEL_2_ALT1, TIM_CHANNEL_2 }, // PB3  TIM2_CH2 -- CAUTION --> JTAG/SWO
         { GPIOB, GPIO_PIN_10,GPIO_AF1_TIM2, TMR_PWM_CHANNEL_3_ALT1, TIM_CHANNEL_3 }, // PB10 TIM2_CH3 / TIM5_CH3  D1    also PB10 TIM2_CH3
         { GPIOA, GPIO_PIN_15,GPIO_AF1_TIM2, TMR_PWM_CHANNEL_1_ALT2, TIM_CHANNEL_1 }, // PA15 TIM2_CH1 -- CAUTION --> JTAG/JTDI
/////    { GPIOB, GPIO_PIN_11,GPIO_AF1_TIM2, TMR_PWM_CHANNEL_4_ALT2, TIM_CHANNEL_4 }, // PB11 TIM2_CH4 / TIM5_CH4  D0
         { 0,          0,             0,              0,              0            }  // end of table
       };

const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_3_channels [] =                  // TIM3
       { {   0L,      0L,            0,               0,              0       }, // STM32                    Arduino
         { GPIOA, GPIO_PIN_6, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PA6  TIM3_CH1              D12   also PC6 TIM3_CH1  also PB4 TIM3_CH1
         { GPIOA, GPIO_PIN_7, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_2, TIM_CHANNEL_2 }, // PA7  TIM3_CH2 / TIM1_CH1N  D11   also PC7 TIM3_CH2  also PB5 TIM3_CH2
         { GPIOB, GPIO_PIN_0, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_3, TIM_CHANNEL_3 }, // PB0  TIM3_CH3 / TIM1_CH2N  A3    also PC8 TIM3_CH3
         { GPIOB, GPIO_PIN_1, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_4, TIM_CHANNEL_4 }, // PB1  TIM3_CH4 / TIM1_CH3N        also PC9 TIM3_CH4
     // Alternates
         { GPIOC, GPIO_PIN_6, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_1_ALT1, TIM_CHANNEL_1 }, // PC6  TIM3_CH1              D12   also PC6 TIM3_CH1  also PB4 TIM3_CH1
         { GPIOC, GPIO_PIN_7, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_2_ALT1, TIM_CHANNEL_2 }, // PC7  TIM3_CH2 / TIM1_CH1N  D11   also PC7 TIM3_CH2  also PB5 TIM3_CH2
         { GPIOC, GPIO_PIN_8, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_3_ALT1, TIM_CHANNEL_3 }, // PC8  TIM3_CH3 / TIM1_CH2N  A3    also PC8 TIM3_CH3
         { GPIOC, GPIO_PIN_9, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_4_ALT1, TIM_CHANNEL_4 }, // PC9  TIM3_CH4 / TIM1_CH3N        also PC9 TIM3_CH4
         { GPIOB, GPIO_PIN_4, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_1_ALT2, TIM_CHANNEL_1 }, // PB4  TIM3_CH1              D12   also PC6 TIM3_CH1  also PB4 TIM3_CH1
         { GPIOB, GPIO_PIN_5, GPIO_AF2_TIM3, TMR_PWM_CHANNEL_2_ALT2, TIM_CHANNEL_2 }, // PB5  TIM3_CH2 / TIM1_CH1N  D11   also PC7 TIM3_CH2  also PB5 TIM3_CH2
         { 0,          0,             0,              0,              0            }  // end of table
       };

const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_4_channels [] =                  // TIM4
       { {   0L,      0L,            0,               0,              0       }, // STM32                    Arduino
         { GPIOB, GPIO_PIN_6, GPIO_AF2_TIM4, TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PB6  TIM4_CH1              D12   also PC6 TIM3_CH1  also PB4 TIM3_CH1
         { GPIOB, GPIO_PIN_7, GPIO_AF2_TIM4, TMR_PWM_CHANNEL_2, TIM_CHANNEL_2 }, // PB7  TIM4_CH2 / TIM1_CH1N  D11   also PC7 TIM3_CH2  also PB5 TIM3_CH2
         { GPIOB, GPIO_PIN_8, GPIO_AF2_TIM4, TMR_PWM_CHANNEL_3, TIM_CHANNEL_3 }, // PB8  TIM4_CH3 / TIM1_CH2N  A3    also PC8 TIM3_CH3
         { GPIOB, GPIO_PIN_9, GPIO_AF2_TIM4, TMR_PWM_CHANNEL_4, TIM_CHANNEL_4 }, // PB9  TIM4_CH4 / TIM1_CH3N        also PC9 TIM3_CH4
         { 0,          0,             0,              0,              0            }  // end of table
       };

const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_5_channels [] =                  // TIM5
       { {   0L,      0L,            0,               0,              0       }, // STM32                    Arduino
         { GPIOA, GPIO_PIN_0, GPIO_AF2_TIM5, TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PA0  TIM5_CH1              D12   also PC6 TIM3_CH1  also PB4 TIM3_CH1
         { GPIOA, GPIO_PIN_1, GPIO_AF2_TIM5, TMR_PWM_CHANNEL_2, TIM_CHANNEL_2 }, // PA1  TIM5_CH2 / TIM1_CH1N  D11   also PC7 TIM3_CH2  also PB5 TIM3_CH2
         { GPIOA, GPIO_PIN_2, GPIO_AF2_TIM5, TMR_PWM_CHANNEL_3, TIM_CHANNEL_3 }, // PA2  TIM5_CH3 / TIM1_CH2N  A3    also PC8 TIM3_CH3
         { GPIOA, GPIO_PIN_3, GPIO_AF2_TIM5, TMR_PWM_CHANNEL_4, TIM_CHANNEL_4 }, // PA3  TIM5_CH4 / TIM1_CH3N        also PC9 TIM3_CH4
         { 0,          0,             0,              0,              0            }  // end of table
       };

const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_9_channels [] =                 // TIM9
       { {   0L,      0L,            0,               0,              0       }, // STM32              Arduino
         { GPIOA, GPIO_PIN_2, GPIO_AF3_TIM9, TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PA2 TIM9_CH1
         { GPIOA, GPIO_PIN_2, GPIO_AF3_TIM9, TMR_PWM_CHANNEL_2, TIM_CHANNEL_2 }, // PA3 TIM9_CH2
         { 0,          0,             0,              0,              0       }     // end of table
       };

const TMPWM_CHANNEL_BLK  _g_tmrpwm_mod_10_channels [] =                // TIM10
       { {   0L,      0L,            0,               0,              0       }, // STM32              Arduino
         { GPIOB, GPIO_PIN_8, GPIO_AF3_TIM10,TMR_PWM_CHANNEL_1, TIM_CHANNEL_1 }, // PB8 TIM10_CH1
         { 0,          0,             0,              0,              0       }     // end of table
       };

