GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
              //---------------------------------------------------------------------
              // Call HAL logic to configure the TIM module for usage.
              //---------------------------------------------------------------------
    if (counter_type >= TIMER_PERIODIC_COUNT_UP && counter_type <= TIMER_ONE_SHOT_COUNT_DOWN)
       {    // Configure the TIMx peripheral for Timer Output
         hdltimer->Instance               = timbase;
         hdltimer->Init.Period            = (period_value - 1); // set # ticks needed for that frequency
         hdltimer->Init.Prescaler         = prescalar_val;
         hdltimer->Init.ClockDivision     = 0;
         hdltimer->Init.CounterMode       = counter_mode;
         hdltimer->Init.RepetitionCounter = 0;
         rc = HAL_TIM_Base_Init (hdltimer);
       }
      else
       {    // Configure the TIMx peripheral for Timer Input
         hdltimer->Instance               = timbase;
//       rc = HAL_TIM_IC_Init (hdltimer);    // count mode = Input capture

       }
    if (rc != HAL_OK)
       {    // got a Base Timer/PWM Initialization Error - bail
         return (ERR_PWM_MODULE_INITIALIZE_FAILED);
       }

        //-----------------------------------------------------------------------
        // denote module has been initialized, and if Complementary PWM is used
        //-----------------------------------------------------------------------
    if (flags & PWM_COMPLEMENTARY_OUTPUTS)
            // user wants to run a pair of channels in complementary mode
       _g_tmpwm_module_status [module_id] = TMR_PWM_COMPLEMENT_INIT;
       else _g_tmpwm_module_status [module_id] = TMR_PWM_NORMAL_INIT; // no complementAry mode

    return (0);                              // denote completed OK
}

                       // The rest of the Physical Timers logic

//*****************************************************************************
//  board_timerpwm_check_completed
//
//        Checks to see if the timer has expired / completed it's cycle.
//        Optionally, resets the completion flag if denoted in reset_flags parm.
//
//        This is frowned upon (callbacks should be used instead), but some
//        people still want to occassionally do polling on this stuff.
//*****************************************************************************
int  board_timerpwm_check_completed (int module_id, int mask_flags, int reset_flags)
{
    TIM_HandleTypeDef   *hdltimer;
    TIM_TypeDef         *timbase;

    if (module_id < 0 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

      // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //-----------------------------------------------------------------------
       // Check Timer's UPDATE flag status, to see if a timer rollover occurred
       //-----------------------------------------------------------------------
    if (timbase->SR & TIM_SR_UIF)
       {      // yes, Timer has popped/rolled over
         if (reset_flags == 1)
            timbase->SR = ~(TIM_SR_UIF);
         return (1);                    // tell caller it popped
       }

//        __HAL_TIM_CLEAR_IT(htim, TIM_IT_UPDATE);
//#define __HAL_TIM_CLEAR_IT(__HANDLE__, __INTERRUPT__)
//             ((__HANDLE__)->Instance->SR = ~(__INTERRUPT__))
// #define TIM_IT_UPDATE     ((uint32_t)0x00000001)  =  TIM_SR_UIF

    return (0);                         // Timer has not popped yet
}


//*****************************************************************************
//  board_timerpwm_config_channel
//
//         Configure a specific channel (1-4) on a specific PWM module (TIM1/2/..)
//
//         For TIM1, allow complmentary mode usage.
//*****************************************************************************

int  board_timerpwm_config_channel (int module_id, int chan_id,
                                    long initial_duty, int mode, int flags)
{
    TIM_OC_InitTypeDef  pchanConfig;      // Timer Output CCR Config
    TIM_HandleTypeDef   *hdltimer;
    TMPWM_CHANNEL_BLK   *pwmblkp;
    int                 rc;
    int                 chan_index;
    uint32_t            hal_channel_num;
    unsigned char       chan_mask;
    unsigned char       rupt_mask;

    if (module_id < 1  ||  module_id > TMRPWM_NUM_MODULES)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);

      // based on module_id, setup pointer to associated TIM module handle
    hdltimer = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    if (_g_tmpwm_module_status [module_id] == 0)
       return (ERR_PWM_MODULE_NOT_INITIALIZED);

//  if ((_g_tmpwm_module_status[modgen_id] & TMR_PWM_NORMAL_INIT) == 0)
//     return (ERR_PWM_MODULE_IN_COMPLEMENTARY); // need to use pwm_config_channel_pair

    if (mode < 0 || mode > TIMER_MODE_PWM)
       return (ERR_PWM_INVALID_TIMER_MODE);

       //-------------------------------------------
       // do any needed pre-scaling on duty_cycle
       //-------------------------------------------
    if ( _g_tmpwm_prescalars[module_id] > 0)
       { initial_duty = (initial_duty / _g_tmpwm_prescalars[module_id]);
       }

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed bad chan_id value

    chan_mask = _g_pwm_chan_mask [chan_index];   // get associated CCR mask bits

       //------------------------------------------------------------------
       //                Check if running as TIMER ONLY
       //
       // Note: user call elect to run the CCR in Timer mode only, and
       //       not sending output out the GPIOs, e.g. Trigger for ADC/DAC.
       //------------------------------------------------------------------
    if (flags & TIMER_CCR_TIMER_ONLY)
       {
         memset (&pchanConfig, '\0',sizeof(pchanConfig));  // ensure cleared out

                // Set the OC mode to "Frozen" so that it only acts as a timer
         pchanConfig.OCMode      = TIM_OCMODE_TIMING;        // Output is frozen
         pchanConfig.OCPolarity  = TIM_OCPOLARITY_LOW;
         pchanConfig.OCIdleState = TIM_OCIDLESTATE_SET;
         pchanConfig.OCFastMode  = TIM_OCFAST_DISABLE;
         pchanConfig.Pulse       = initial_duty;       // Set duty cycle for CCR
         rc = HAL_TIM_OC_ConfigChannel (hdltimer, &pchanConfig,
                                      hal_channel_num); // config for Timer only
                // denote that it has been configured, and should be enabled.
         _g_tmpwm_channels_config [module_id] |= chan_mask;

         return (0);               // denote completed OK
       }

       //--------------------------------------------------------------
       // turn on PWM flag if this is a PWM based module/channel
       //--------------------------------------------------------------
    if (mode == TIMER_MODE_PWM ||  mode == TIMER_MODE_PWM_INV)
       _g_tmpwm_channels_config [module_id] |= TMR_USING_PWM_MODE;

       //------------------------------------------------------------------
       //        Setup associated GPIO pin into Timer/PWM mode.
       //
       // Configure Timer/PWM Channel's GPIO pin into Alternate function,
       // push-pull, 100MHz speed.
       //
       // Note: user call elect to run the CCR in Timer mode only, and
       //       not sending output out the GPIOs, e.g. Trigger for ADC/DAC.
       //------------------------------------------------------------------
    if (module_id == 1)
       pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_1_channels [chan_index];
       else if (module_id == 2)
               pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_2_channels [chan_index];
       else if (module_id == 3)
               pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_3_channels [chan_index];
       else if (module_id == 4)
               pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_4_channels [chan_index];
       else if (module_id == 5)
               pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_5_channels [chan_index];
       else if (module_id == 6)
               pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_9_channels [chan_index];  // NOTE MAPPING: PWM != TIMER ID
       else if (module_id == 7)
               pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_10_channels [chan_index];
               else pwmblkp = (TMPWM_CHANNEL_BLK*) &_g_tmrpwm_mod_11_channels [chan_index];

