GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

      // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

// ??? TBD   stop every PWM channel that is enabled on this module    ??? !!!

    if (_g_tmpwm_module_status [module_id] & TMR_PWM_INTERRUPTS_USED)
       HAL_TIM_Base_Stop_IT (hdltimer);    // Disable the timer and interrupts
       else HAL_TIM_Base_Stop (hdltimer);  // Disable the Timer


// ??? !!! Disable before/after OC Timer_Disable ??? !!!  FUTURE
// ???     associated Compare/Capture OC elements must also be disabled !!!
//  HAL_TIM_OC_Stop_IT (hdltimer, Channel);
// ??? must associated Compare/Capture OC elements also be stopped ?
//  HAL_TIM_IC_Stop_IT (hdltimer, Channel);  // input capture

    return (0);                         // denote completed OK
}



//*****************************************************************************
//  board_timerpwm_enable
//
//         Enables and Starts the timer/PWM.
//
//         Sets up any desired Timer interrupt flags, then enables the Timer/PWM.
//         Saves optional callback function address to call when interrupt occurs.
//*****************************************************************************

int  board_timerpwm_enable (int module_id, int interrupt_flags)
{
    TIM_HandleTypeDef  *hdltimer;
    int                irqn;
    int                rc;
    int                app_ccr_rupts;
    unsigned char      channels_config;

    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //-----------------------------------------------------------------------
       // If user requested a Rollover interrupt,  OR  setup interrupts on a CCR
       // then enable the necessary NVIC entry
       //-----------------------------------------------------------------------
                   // find and set associated NVIC IRQ value
    irqn = _g_TMPWM_IRQ_table [module_id];
    if (interrupt_flags != 0 || _g_timer_app_enabled_interrupts[module_id])
       {           // denote this module is running with Interrupts
         _g_tmpwm_module_status [module_id] |= TMR_PWM_INTERRUPTS_USED;
         if (interrupt_flags & TIMER_ENABLE_ROLLOVER_INTERRUPTS)
            {      //------------------------------------------------------
                   // set assoc ROLLOVER/Update flag for the overall Timer
                   //------------------------------------------------------
              _g_timer_app_enabled_interrupts[module_id] |= TIM_SR_UIF;
              if (module_id == 1)
                 {         // TIM1 has a separate IRQn for Rollovers
                   NVIC_EnableIRQ (TIM1_UP_TIM10_IRQn);           // Enable NVIC
                   NVIC_SetPriority (TIM1_UP_TIM10_IRQn, 1);
                 }
              else {       // handle all the other timers Rollovers
                     NVIC_EnableIRQ (irqn);                       // Enable NVIC
                     NVIC_SetPriority (irqn, 1);
                   }
            }
           else {          // handle all the other timers CCRs and TIM1 CCRs
                           // find and set associated NVIC IRQ value
                     NVIC_EnableIRQ (irqn);                       // Enable NVIC
                     NVIC_SetPriority (irqn, 1);
                }

                   //---------------------------------------------------
                   //  Enable the Timer/PWM to start, _with_ Interrupts
                   //---------------------------------------------------
          HAL_TIM_Base_Start_IT (hdltimer);
        }
       else {
                   //------------------------------------------------
                   // Enable Timer/PWM to start,  _no_ interrupts
                   //------------------------------------------------
              HAL_TIM_Base_Start (hdltimer);
            }

       //------------------------------------------------------------------------
       // Startup each Timer/PWM channel that has been configured for this module
       //
       // After the main timer has been started, walk through and enable
       // each CCR requested by the user app. This will turn on the Output at
       // the GPIO pin, and turn on the associated CCR interrupt if requested.
       // Note: there is no substanitive difference between HAL_TIM_PWM_Start()
       //       and HAL_TIM_OC_Start()
       //------------------------------------------------------------------------
    channels_config = _g_tmpwm_channels_config [module_id];        // get local copy of CCR configed flags
    app_ccr_rupts   = _g_timer_app_enabled_interrupts [module_id]; // get local copy of CCR interrupts
    if (channels_config & TMR_CCR1_CONFIGURED)
       {     // start channel 1, and optionally, channel 1N
         if (app_ccr_rupts & TIM_SR_CC1IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC1);  // Enable CCR1 rupt
            }
         if (channels_config & TMR_USING_PWM_MODE)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_1);
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_1);
         if (channels_config  &  TMR_CCR1N_CONFIGURED  &&  rc == HAL_OK)
            {    // operating in (PWM) complementary mode - turn on channel 1N too
              rc = HAL_TIMEx_PWMN_Start (hdltimer, TIM_CHANNEL_1);
            }
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
       }

    if (channels_config  &  TMR_CCR2_CONFIGURED)
       {     // start channel 2, and optionally, channel 2N
         if (app_ccr_rupts & TIM_SR_CC2IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC2);  // Enable CCR2 rupt
            }
         if (channels_config & TMR_USING_PWM_MODE)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_2);
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_2);
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
         if (channels_config  &  TMR_CCR2N_CONFIGURED  &&  rc == HAL_OK)
            {    // operating in complementary mode - turn on channel 2N too
              rc = HAL_TIMEx_PWMN_Start (hdltimer, TIM_CHANNEL_2);
            }
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
       }

    if (channels_config  &  TMR_CCR3_CONFIGURED)
       {     // start channel 3, and optionally, channel 3N
         if (app_ccr_rupts & TIM_SR_CC3IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC3);  // Enable CCR3 rupt
            }
         if (channels_config & TMR_USING_PWM_MODE)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_3);
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_3);
         if (channels_config  &  TMR_CCR3N_CONFIGURED  &&  rc == HAL_OK)
            {    // operating in complementary mode - turn on channel 3N too
              rc = HAL_TIMEx_PWMN_Start (hdltimer, TIM_CHANNEL_3);
            }
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail
       }

    if (channels_config  &  TMR_CCR4_CONFIGURED)
       {     // start channel 4
         rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_4);
         if (app_ccr_rupts & TIM_SR_CC4IF)
            {    // User wants to see interrupts on this CCR
              __HAL_TIM_ENABLE_IT (hdltimer, TIM_IT_CC4);  // Enable CCR4 rupt
            }
         if (channels_config & TMR_USING_PWM_MODE)
            rc = HAL_TIM_PWM_Start (hdltimer, TIM_CHANNEL_4);
            else rc = HAL_TIM_OC_Start (hdltimer, TIM_CHANNEL_4);
         if (rc != HAL_OK)
            return (ERR_PWM_CHANNEL_START_FAILED);      // start failed - bail

         // Channel 4 does _NOT_ have a complementary output (no channel 4N) !
       }


