GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    return (0);                         // denote completed OK
}

//#endif                                  //  USES_DAC  ||  USES_TIMER


//#if defined(USES_TIMER)

//*****************************************************************************
//  board_timerpwm_enable_CCR_output
//
//        Configures and enables Timer Output Compare wave generation on the
//        requested channel, and its associated GPIO pin and CCR.
//
//    Parameters:
//        initial_duty - specifies the associated "duty cycle" for the pin's
//                       CCR register to be set to
//
//        action_flags:
//          - TIMER_ACTION_TOGGLE     toggle the OC GPIO output every time
//                                    the CCR value reached,
//          - TIMER_ACTION_GO_ACTIVE  wait till CCR value reached, then drive
//                                    the OC GPIO output high
//                                    (and leave it there forever until reset)
//          - TIMER_ACTION_PULSE      similar to the above
//          - TIMER_ACTION_GO_INACTIVE  wait till CCR value reached, then drive
//                                    the OC GPIO output low
//                                    (and leave it there forever until reset)
//          - TIMER_PIN_POLARITY_HIGH the GPIO pin goes high when CCR hit
//          - TIMER_PIN_POLARITY_LOW  the GPIO pin goes low when CCR hit (Inverted output)
//
//        interrupt_flags:
//          - TIMER_NO_INTERRUPT     no interrupts are signalled when CCR value
//                                   is reached.
//          - TIMER_ENABLE_CCR_INTERRUPTS   an interrupt is signalled when CCR
//                                   value hit is reached. It will invoke the
//                                   callback_function that was provided on the
//                                   board_timerpwm_enable() call. It will pass
//                                   to the callback function the callback_parm
//                                   and a TIMER_xxxx_INTERRUPT flag.
//*****************************************************************************
int  board_timerpwm_enable_CCR_output (int module_id, int chan_id, long initial_duty,
                                       int action_flags, int interrupt_flags)
{
    int         mode;
    int         rc;
    int         flags;

       // tweak parms to match board_timerpwm_config_channel() format
    mode  = action_flags & 0x0F;
    flags = interrupt_flags & 0xF0;

       // all heavy lifting is done by board_timerpwm_config_channel()
    rc = board_timerpwm_config_channel (module_id, chan_id,
                                        initial_duty, mode, flags);

    return (rc);                      // denote worked successfully
}



//*****************************************************************************
//  board_timerpwm_get_current_value
//
//         Gets the current count value (CNT) in the Timer/PWM.
//*****************************************************************************
long  board_timerpwm_get_current_value (int module_id)
{
    TIM_TypeDef      *timbase;
    long             curr_count;

    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    curr_count = timbase->CNT;      // get currnet COUNT value

       //---------------------------------------------------------------
       // re-adjust COUNT value based on pre-scalar to get user's view
       //---------------------------------------------------------------
    if (_g_tmpwm_prescalars[module_id] > 0)
       curr_count = (curr_count * _g_tmpwm_prescalars[module_id]);

    return (timbase->CNT);          // pass back adjusted current counter value
}


//*****************************************************************************
//  board_timerpwm_get_CCR_capture_value
//
//         Gets the recorded input capture value in the Timer/PWM.
//*****************************************************************************
long  board_timerpwm_get_CCR_capture_value (int module_id, int CCR_channel_id)
{
    TIM_HandleTypeDef   *hdltimer;
    long                cap_value;

    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       // based on module_id, setup pointer to associated timer objects
    hdltimer = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    cap_value = HAL_TIM_ReadCapturedValue (hdltimer, CCR_channel_id);

// ??? !!! must I adjust the value based on pre-scalar used ??? !!!

    return (cap_value);             // passback capture value
}


//*****************************************************************************
//  board_timerpwm_get_duty_cycle
//
//        Get the Timer/PWM's current duty cycle.      Used for monitoring, etc
//*****************************************************************************

long  board_timerpwm_get_duty_cycle (int module_id, int chan_id)
{
    TIM_HandleTypeDef   *hdltimer;
    long                curr_duty;
    int                 hal_channel_num;
    int                 chan_index;

    if (module_id < 1  ||  module_id > TMRPWM_NUM_MODULES)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);

            // get ptr to associated TIM module handle
    hdltimer = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (hdltimer == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed bad chan_id value

    switch (chan_index)
      { case 1:
              curr_duty = hdltimer->Instance->CCR1;
              break;
        case 2:
              curr_duty = hdltimer->Instance->CCR2;
              break;
        case 3:
              curr_duty = hdltimer->Instance->CCR3;
              break;
        case 4:
              curr_duty = hdltimer->Instance->CCR4;
              break;
        default:
                // this must be one of the N channels -
                // it does _NOT_ have its own CCRxN.  It relies on CCR1/1/3/4
              return (ERR_PWM_CHANNEL_COMPLE_CHAN_NO_CCR);
      }

       //-------------------------------------------------------------
       // re-adjust duty value based on pre-scalar to get user's view
       //-------------------------------------------------------------
    if (_g_tmpwm_prescalars[module_id] > 0)
       curr_duty = (curr_duty * _g_tmpwm_prescalars[module_id]);

    return (curr_duty);
}


//*****************************************************************************
//  board_timerpwm_get_period
//
//         Gets the period value (ARR) being used by the Timer/PWM.
//         Used for monitoring, etc
//*****************************************************************************
long  board_timerpwm_get_period (int module_id)
{
    TIM_TypeDef      *timbase;
    long             curr_period;

