GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    curr_period = timbase->ARR;     // get currnet PERIOD value

       //---------------------------------------------------------------
       // re-adjust period value based on pre-scalar to get user's view
       //---------------------------------------------------------------
    if (_g_tmpwm_prescalars[module_id] > 0)
       curr_period = (curr_period * _g_tmpwm_prescalars[module_id]);

    return (curr_period);          // pass back adjusted current period value
}


//*****************************************************************************
//  board_timerpwm_reset_CCR_output
//
//        Re-Configures and shuts off Timer Output Compare wave generation on
//        the requested channel.
//
//        This is used to turn off a CCR GPIO pin that was triggerred to a
//        constant value (e.g. reset a one-shot, in preparation for another
//        action).
//
//        This function is mainly used for OC modes:
//          - TIMER_ACTION_GO_ACTIVE  which will drive the OC output high
//                                    (and leave it there forever until reset)
//          - TIMER_ACTION_PULSE
//          - TIMER_ACTION_GO_INACTIVE  which will drive the OC output low
//                                    (and leave it there forever until reset)
//
//        flags - future use
//*****************************************************************************
int  board_timerpwm_reset_CCR_output (int module_id, int chan_num, int flags)
{
    uint32_t    timer_base_addr;
    int         mode;

    if (module_id < 1  ||  module_id >= TMRPWM_NUM_MODULES)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);
    if (chan_num < 1  ||  chan_num > TMPWM_MAX_CHANNELS)
       return (ERR_PWM_CHANNEL_NUM_OUT_OF_RANGE);


#if (MSP432_CODE)      //  WVD  ??? !!! NEED TO CREATE EQUIV FOR STM32  ??? !!!

    timer_base_addr = _g_timer_base_address [module_id];  // get approp TA0-TA3

    mode = OUTMOD_5;                    // config CCR to shutoff GPIO   or use OUTMOD_0 ?
    switch (chan_num)
       { case 1:                        //   TAn  CCR1
               HWREG16(timer_base_addr + OFS_TA0CCTL1)  = mode;
               break;
         case 2:                        //   TAn  CCR2
               HWREG16(timer_base_addr + OFS_TA0CCTL2) = mode;
               break;
         case 3:                        //   TAn  CCR3
               HWREG16(timer_base_addr + OFS_TA0CCTL3) = mode;
               break;
         case 4:                        //   TAn  CCR4
               HWREG16(timer_base_addr + OFS_TA0CCTL4) = mode;
               break;
         case 5:                        //   TAn  CCR5
               HWREG16(timer_base_addr + OFS_TA0CCTL5) = mode;
               break;
         case 6:                        //   TAn  CCR6
               HWREG16(timer_base_addr + OFS_TA0CCTL6) = mode;
               break;
       }
#endif

    return (0);                      // denote worked successfully
}


//*****************************************************************************
//  board_timerpwm_set_callback
//
//          callback_function and callback_parm are used to provide callback
//          when any Timer rollover or CCR interrupts occur.
//*****************************************************************************
int  board_timerpwm_set_callback (int module_id, TMR_CB_EVENT_HANDLER callback_function,
                                  void *callback_parm)
{
    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

       //-------------------------------------------------------------------
       // Save any call back information, for interrupts (CCRs or Rollover)
       //-------------------------------------------------------------------
    _g_ptimer_callback [module_id]      = callback_function;
    _g_ptimer_callback_parm [module_id] = callback_parm;

    return (0);                 // denote completed OK
}



//******************************************************************************
//  board_timerpwm_set_duty_cycle
//
//        Set the Timer/PWM's duty cycle, aka
//        sets a CCR (compare count register) on the specified timer.
//
//        This is used to set different "duty cycles" for wave form values
//        being generated by a Timer, e.g. CCR1 might generate a 25 % duty
//        cycle on channel 1 pin, 33 % on channel 2 pin, and 50 % on chan 3 pin.
//
//        The flags parms is used to specify if a CCR interrupt should be
//        generated when the CCR compare value is hit by the Timer/PWM.
//******************************************************************************
int  board_timerpwm_set_duty_cycle (int module_id, int chan_id,
                                    long ccr_duty_cycle, int flags)
{
    TIM_TypeDef         *timbase;
    int                 hal_channel_num;
    int                 chan_index;

    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

            // get ptr to associated TIM register
    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed bad chan_id value

       //-------------------------------------------
       // do any needed pre-scaling on duty_cycle
       //-------------------------------------------
    if ( _g_tmpwm_prescalars[module_id] > 0)
       { ccr_duty_cycle = (ccr_duty_cycle / _g_tmpwm_prescalars[module_id]);
       }

    switch (chan_index)
      {
        case 1:
               timbase->CCR1 = ccr_duty_cycle;
               break;
        case 2:
               timbase->CCR2 = ccr_duty_cycle;
               break;
        case 3:
               timbase->CCR3 = ccr_duty_cycle;
               break;
        case 4:
               timbase->CCR4 = ccr_duty_cycle;
               break;
      }

