GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
    return (0);                         // denote completed OK
}


//*****************************************************************************
//  board_timerpwm_set_period
//
//         Sets the Timer/PWM to use a new period value
//*****************************************************************************
int  board_timerpwm_set_period (int module_id, long new_period_value, int flags)
{
    TIM_TypeDef         *timbase;
    uint32_t            period_val;
    uint32_t            prescalar_val;

    if (module_id < 1 || module_id > MAX_TIMER)
       return (ERR_TIMER_NUM_OUT_OF_RANGE);

    timbase  = (TIM_TypeDef*) _g_timer_module_base [module_id];
    if (timbase == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);

    prescalar_val = 0;
    period_val    = new_period_value;

    if ((flags & TIMER_DISABLE_DAC_PRESCALING) == 0)
       {       //-------------------------------------------
               //  do any needed pre-scaling on new period
               //-------------------------------------------
               // Compute any needed prescaler value to fit 16-bit TIMx counter clock
         prescalar_val = board_timerpwm_compute_prescalar (period_val);
         if (prescalar_val > 0)
            period_val = (period_val / prescalar_val);
         _g_tmpwm_prescalars[module_id] = prescalar_val; // save for duty cycle calcs
       }
      else _g_tmpwm_prescalars[module_id] = 0;  // no pre-scalars used

    timbase->ARR = period_val;

    timbase->PSC = prescalar_val;

    return (0);                         // denote completed OK
}


//*****************************************************************************
//  board_timerpwm_set_dead_time
//
//         Set the PWM's dead time between complementary PWM
//         arrangements.  Use to avoid "shoot through" on the
//         output FETs when working with Power or Motor H-bridges.
//*****************************************************************************

int  board_timerpwm_set_dead_time (int module_id, int rising_edge, int falling_edge)
{
    TIM_HandleTypeDef   *tmrpwm_mhdl;
    int                 rc;
    uint32_t            scaleduty;

    if (module_id != 1)
       return (ERR_PWM_MODULE_NO_DEADTIME);   // Only TIM1 supports Deadtime

            // get ptr to associated TIM module handle
    tmrpwm_mhdl = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];

    tmrpwm_mhdl->Instance->BDTR &= ~(0xFF00); // clear out any previous DT value
    tmrpwm_mhdl->Instance->BDTR |= (rising_edge & 0x00FF);   // set 8 bit deadtime

       // trailing edge is ignored, because STM32 F4 TIM1 only supports a
       // single deadtime value, that is used on both rising and falling edges.

    return (0);                // denote completed successfully
}


//*****************************************************************************
//  board_timerpwm_set_phase
//
//         Set the PWM's phase between complementary PWM
//         arrangements.
//*****************************************************************************

int  board_timerpwm_set_phase (int module_id, int chan_num, long phase_offset)
{
   return (ERR_PWM_MODULE_NO_PHASE); // STM32 F4, F1, F0, L1, L0 do NOT support
                                     // phase shifting. Only STM32 F3 modules do
}



//*****************************************************************************
//  board_timerpwm_set_channel_output
//
//         Set polarity of Timer/PWM channel output (start high or low)
//*****************************************************************************
int  board_timerpwm_set_channel_output (int module_id, int chan_id,
                                        int output_mode, int flags)
{
    TIM_HandleTypeDef   *tmrpwm_mhdl;
    int                 rc;
    int                 hal_channel_num;
    int                 chan_index;

    if (module_id < 1  ||  module_id > TMRPWM_NUM_MODULES)
       return (ERR_PWM_MODULE_ID_OUT_OF_RANGE);

       //----------------------------------------------------------------
       // Convert extended channel numbers: ALT1 / ALT2 / _N / _N_ALT to
       // the underlying base channel number needed for HAL_TIM_PWM calls
       //----------------------------------------------------------------
    hal_channel_num = board_timerpwm_channel_lookup (chan_id, &chan_index);
    if (hal_channel_num == -1)
       return (ERR_TIMER_CHANNEL_NUM_OUT_OF_RANGE);  // passed a bad chan_id value

            // get ptr to associated TIM module handle
    tmrpwm_mhdl = (TIM_HandleTypeDef*) _g_timer_module_handle [module_id];
    if (tmrpwm_mhdl == 0L)
       return (ERR_TIMER_NUM_NOT_SUPPORTED);


//   ???   TBD   ???     WVD   ???



    return (0);                // denote completed successfully
}



//******************************************************************************
//                           TIMER / PWM   ISRs
//******************************************************************************

void  TIM_Common_IRQHandler(TIM_TypeDef *TIMbase, int tim_index);
void  TIM1_UP_TIM10_IRQHandler(void);    // -- CAUTION SHARED BETWEEN TIM1 and TIM10
void  TIM1_CC_IRQHandler(void);
void  TIM2_IRQHandler(void);
void  TIM3_IRQHandler(void);
void  TIM4_IRQHandler(void);
void  TIM5_IRQHandler(void);
void  TIM1_BRK_TIM9_IRQHandler(void);
void  TIM1_TRG_COM_TIM11_IRQHandler(void);


//******************************************************************************
// TIM_Common_IRQHandler
//
//         To minimize redundant logic in each IRQ handler, we just route every
//         Timer IRQ to here, passing in the relevant parms (TIMx base, ...).
//
//         Note: on ST processors, unused interrupt flags may be set on
//               even though we are not using them, or the app is ignoring them
//               for callbacks. So we have to first filter what interrupts we
//               are going to look at based on User App's interrupt_flag
//               settings on timer_Enable() and timer_Enable_CCR_Output(),
//               and ignore the rest.
//******************************************************************************

void  TIM_Common_IRQHandler (TIM_TypeDef *TIMbase, int tim_index)
{
   int                 interrupt_type;
   register  uint16_t  app_rupts_mask;
   TIM_HandleTypeDef   *timHandle;

       //--------------------------------------------------------------
       // get a local copy of what interrupts the User App wants
       // to be called back on. In optimized compilers, this should
       // get loaded into a local register.
       //--------------------------------------------------------------
  app_rupts_mask  = _g_timer_app_enabled_interrupts [tim_index];
  app_rupts_mask &= TIMbase->SR;  // Mask the app specified interrupts against
                                  // the interrupt status register SR. The result
                                  // is those interrupts the app is interested in

       // Handle timing window, where App requested Timer/PWM Disable, but there
       // were still some interrupts left in the pipe.
  if ((TIMbase->CR1 & TIM_CR1_CEN) == 0)
     {    // Timer/PWM is Disabled. Clear any remaining interrupts
       TIMbase->SR = ~(TIMbase->SR);
       return;                               // then bail out
     }

  if (app_rupts_mask == 0)
     {     // we got an interrupt, but have no active config/setup for that CCR.
           // Must have been a private deal/setup by user app, or timing window.
           // Call HAL Library to handle it, and possibly invoke user callback.
       timHandle = (TIM_HandleTypeDef*) _g_timer_module_handle [tim_index];
       if (timHandle != 0L)
          HAL_TIM_IRQHandler (timHandle);    // Have HAL deal with it
          else {     // We got an interrupt but no handler for it.
                     // Just discard it, otherwise we get int a looping
                     // "Hot I/O" interrupt scenario.
                 TIMbase->SR = ~(TIMbase->SR);         // discard the interrupt
               }
       return;                               // then bail out
     }


