GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
       //---------------------------------------------------------------------
       // We sequentially walk down each key interrupt type, so that if
       // multiple interrupts are signalled at the same time, we handle them.
       //---------------------------------------------------------------------
  if (app_rupts_mask & TIM_SR_UIF)       // is it an update/rollover interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_ROLLOVER_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_UPDATE);               // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for UPDATE / rollover rupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC1IF)        // is it a CCR1  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR1_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC1);                 // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC2IF)        // is it a CCR2  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR2_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC2);                 // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC3IF)          // is it a CCR3  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR3_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC3);                 // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

  if (app_rupts_mask & TIM_SR_CC4IF)        // is it a CCR4  interrupt ?
     {      //---------------------------------------------------------
            // clear the interrupt, then invoke any optional callback
            //---------------------------------------------------------
       interrupt_type = TIMER_CCR4_INTERRUPT;
       TIMbase->SR    = ~(TIM_IT_CC4);                 // clear the interrupt flag
       if (_g_ptimer_callback[tim_index] != 0L)
          {             // Invoke user callback for the interrupt
            (_g_ptimer_callback[tim_index]) (_g_ptimer_callback_parm[tim_index],
                                             interrupt_type);
          }
     }

//  HAL_TIM_IRQHandler (TIM_HandleTypeDef *htim);  // clear Timer interrupt and callback user app
}


void  TIM1_UP_TIM10_IRQHandler (void)  // NVIC IRQn is: TIM1_UP_TIM10_IRQn
{
    if (TIM1->SR & TIM_SR_UIF)
       TIM_Common_IRQHandler (TIM1, 1);

    if (TIM10->SR & (TIM_SR_UIF | TIM_SR_CC1IF | TIM_SR_CC2IF | TIM_SR_CC3IF | TIM_SR_CC4IF))
       TIM_Common_IRQHandler (TIM10, 10);
}

void  TIM1_CC_IRQHandler(void)         // NVIC IRQn is:    TIM1_CC_IRQn
{
    TIM_Common_IRQHandler (TIM1, 1);
}

void  TIM2_IRQHandler (void)           // NVIC IRQn is:    TIM2_IRQn
{
    TIM_Common_IRQHandler (TIM2, 2);
}

void  TIM3_IRQHandler (void)           // NVIC IRQn is:    TIM3_IRQn
{
    TIM_Common_IRQHandler (TIM3, 3);
}

void  TIM4_IRQHandler(void)            // NVIC IRQn is:    TIM4_IRQn
{
    TIM_Common_IRQHandler (TIM4, 4);
}

void  TIM5_IRQHandler (void)           // NVIC IRQn is:    TIM5_IRQn
{
    TIM_Common_IRQHandler (TIM5, 5);
}

void  TIM1_BRK_TIM9_IRQHandler (void)  // NVIC IRQn is:    TIM1_BRK_TIM9_IRQn
{
        // We do not support TIM1_BRK rupts, so only TIM9 rupts should show up
    TIM_Common_IRQHandler (TIM9, 9);
}

void  TIM1_TRG_COM_TIM11_IRQHandler (void)     // NVIC IRQn is:    TIM1_TRG_COM_TIM11_IRQn
{
        // We do not support TIM1_COM/TRIGGER rupts, so only TIM11 rupts should show up
    TIM_Common_IRQHandler (TIM11, 11);
}

//#endif                                 //  USES_TIMER





//*****************************************************************************
//*****************************************************************************
//                               UART   Routines
//*****************************************************************************
//*****************************************************************************

//*****************************************************************************
//  board_uart_init
//
//          CAUTION: you MUST set _g_UartHandle.Init.Parity to UART_PARITY_NONE,
//                   else HAL Lib will default to odd parity and turn on the
//                   UART CR1 PCE and PS bits, whioh totally screws things up !
//*****************************************************************************

void  board_uart_init (void)
{
    // see Clive Example that works fine  (uses old Std Lib, not HAL)

#if defined(USES_CONSOLE_WRITE) || defined(USES_CONSOLE_READ) || defined(USES_DEBUG_LOG)
    GPIO_InitTypeDef    GPIO_InitStruct;

       //--------------------------------------------------
       // Configure the GPIOs that used for the UART pins
       // PA.2 = USART2_TX    PA.3 = USART2_RX
       //--------------------------------------------------
    GPIO_InitStruct.Pin        = GPIO_PIN_2 | GPIO_PIN_3;
    GPIO_InitStruct.Alternate  = GPIO_AF7_USART2;     // set Alt Function - UART
    GPIO_InitStruct.Mode       = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull       = GPIO_PULLUP;
    GPIO_InitStruct.Speed      = GPIO_SPEED_FAST;
    HAL_GPIO_Init (GPIOA, &GPIO_InitStruct);          // Setup UART GPIO pins

       //--------------------------------------------------
       // Configure the UART module.  Default = 115200
       //--------------------------------------------------
    __HAL_RCC_USART2_CLK_ENABLE();                  // Turn on UART clocks

    _g_UartHandle.Instance        = USART2;         //   Set UART module to use
    _g_UartHandle.Init.BaudRate   = 115200;
    _g_UartHandle.Init.WordLength = UART_WORDLENGTH_8B;     // setup as 8N1
    _g_UartHandle.Init.StopBits   = UART_STOPBITS_1;
    _g_UartHandle.Init.Parity     = UART_PARITY_NONE;       // no parity  KEY !
    _g_UartHandle.Init.HwFlowCtl  = UART_HWCONTROL_NONE;    // No flow ctl
    _g_UartHandle.Init.OverSampling = UART_OVERSAMPLING_16;
    _g_UartHandle.Init.Mode       = UART_MODE_TX_RX;        // Enable RX and TX

