GrandviewIoT/Industrial_IoT_Projects/boards/STM32_Bds/STM32_F4/board_F4_PREV_All_in_One_PREV.c
void  board_vtimer_check_expiration (uint32_t gsystick_millisecs)
{
    int   i;

          //-------------------------------------------------------------
          // See if any virtual timers have reached their expiration time
          //-------------------------------------------------------------
    for (i = 0; i < 10;  i++)
      {
        if (_g_vtimer_flags[i] != VTIMER_BUSY)
           continue;                       // timer is not active, skip it

        if (_g_vtimer_expire [i] > gsystick_millisecs)
           continue;                       // still not reach the timeout value
// ??? TBD - CHECK TIMER, MUST ALSO HANDLE 49-day wrap-around ??? !!!

                 //----------------------------------------------------------
                 // The VTIMER has reached its expiration time, so set
                 // the COMPLETED flag, and invoke any associated callback.
                 //----------------------------------------------------------
             _g_vtimer_user_flags[i] = VTIMER_COMPLETED;  // update user state

             if (_g_vtimer_callback[i] != 0L)
                {      //  invoke user supplied callback, passing parm
                  (_g_vtimer_callback[i]) (_g_vtimer_callback_parm [i]);
                }

                   // Then setup next timeout deadline
                   // This keeps the VTIMER keep firing until user issue vtimer_reset() to cancel it
             _g_vtimer_expire [i] += _g_vtimer_duration[i];
           }
}


//*****************************************************************************
//  board_vtimer_start
//
//              Start a VTIMER, with a given milli-second timeout value.
//              Optionally, a callback and parameter can be provided.
//
//              Timer duration must be specified in milliseconds.
//              It has a maximum limit of 1,000,000,000  (277 hours or 11 days)
//*****************************************************************************

int  board_vtimer_start (int vtimer_id, uint32_t timer_duration_millis,
                         P_EVENT_HANDLER callback_function,  void *callback_parm)
{
     if (vtimer_id < 0 || vtimer_id > 9)
        return (ERR_VTIMER_ID_OUT_OF_RANGE);
     if (_g_vtimer_flags[vtimer_id] == VTIMER_BUSY)
        return (ERR_VTIMER_IN_USE);
     if (timer_duration_millis > 1000000000)
        return (ERR_VTIMER_MILLISEC_EXCEED_LIMIT);

     _g_vtimer_flags[vtimer_id] = VTIMER_BUSY;       // internal state
     _g_vtimer_user_flags [vtimer_id] = VTIMER_BUSY; // user view of state

          // Add VTIMER millis to current SYSTICK value. If it
          // wraps around, we depend upon the VTIMER expiration logic to handle it.
     _g_vtimer_expire[vtimer_id] = _g_systick_millisecs + timer_duration_millis;

          // save the VTIMER duration, so we can step expiration to next
          // interval, after each VTIMER "pop"
     _g_vtimer_duration[vtimer_id] = timer_duration_millis;

          // save any callback information
     _g_vtimer_callback [vtimer_id]     = callback_function;
     _g_vtimer_callback_parm [vtimer_id] = callback_parm;

          // increment the number of active VTIMERs
    _g_vtimers_active++;

    return (0);               // denote completed successfully
}


//*****************************************************************************
//  board_vtimer_completed
//
//              Check if a VTIMER that is busy or completed.
//              0 = Busy,   1 = completed,  -1 = error
//*****************************************************************************

int  board_vtimer_completed (int vtimer_id)
{
     if (vtimer_id < 0 || vtimer_id > 9)
        return (ERR_VTIMER_ID_OUT_OF_RANGE);

     if (_g_vtimer_user_flags[vtimer_id] == VTIMER_BUSY)
        return (0);                       // not completed, still busy

     if (_g_vtimer_user_flags[vtimer_id] == VTIMER_COMPLETED)
        {     // we told the user, so clear it's state so he knows when it pops next
          _g_vtimer_user_flags [vtimer_id] = VTIMER_BUSY;  // reset user flag
          return (1);                     // has completed
        }

     return (-1);                         // else is reset, and was not active
}


//*****************************************************************************
//  board_vtimer_reset
//
//              Stop and reset a VTIMER that is busy or completed.
//*****************************************************************************

int  board_vtimer_reset (int vtimer_id)
{
     if (vtimer_id < 0 || vtimer_id > 9)
        return (ERR_VTIMER_ID_OUT_OF_RANGE);

     _g_vtimer_flags[vtimer_id] = VTIMER_RESET;
     _g_vtimer_user_flags [vtimer_id] = VTIMER_RESET;

    return (0);               // denote completed successfully
}
#endif



//*****************************************************************************
//*****************************************************************************
//                               CC3000   DEVICE   Routines
//*****************************************************************************
//*****************************************************************************




#if defined(USES_CC3000)  ||  defined(CC3000_USE_BOOSTERPACK1)
//*****************************************************************************
// The following routines/callbacks are invoked by the CC3000 Host Driver
// library, as part of its normal course of operation
//*****************************************************************************

//*****************************************************************************
//
//  ReadWlanInterruptPin
//
//
//       return CC3000 interrupt pin status     IRQ   PB3  Arduino Digital # 3
//*****************************************************************************
long  ReadWlanInterruptPin (void)
{
    irq_state = HAL_GPIO_ReadPin (CC3000_IRQ_IN_GPIO_PORT, CC3000_IRQ_IN_PIN);
/// irq_state = __HAL_GPIO_EXTI_GET_IT (CC3000_IRQ_IN_PIN);

    return (irq_state);
}


//*****************************************************************************
//  WlanInterruptEnable
//
//       Enable interrupts from the CC3000 IrQ pin
//
//       Note: this ultimately invokes CMSIS's core_cm4.h NVIC_EnableIRQ()
//             macro, which updates NVIC->ISER
//             For software testing, can use NVIC_SetPendingIRQ(IRQn_Type IRQn)
//             to force it on.
//*****************************************************************************
void  WlanInterruptEnable()
{
    HAL_NVIC_EnableIRQ (EXTI3_IRQn);

    IRQ_interrupts_enabled = 1;
}

//*****************************************************************************
//  WlanInterruptDisable
//
//       Disable interrupts from the CC3000 IRQ pin
//
//       Note: this ultimately invokes CMSIS's core_cm4.h NVIC_EnableIRQ()
//             macro, which updates NVIC->ICER
//*****************************************************************************
void  WlanInterruptDisable()
{
    HAL_NVIC_DisableIRQ (EXTI3_IRQn);

    IRQ_interrupts_enabled = 0;

//  __HAL_GPIO_EXTI_CLEAR_IT (CC3000_IRQ_IN_PIN);  // clear any left over rupts
}


//*****************************************************************************
//
//  WriteWlanPin                              ENABLE  PB4  Arduino Digital # 5
//
//       Toggle CC3000 PIN to ENABLE and DISABLE the CC3000 Radio.
//
//       Note: Raising the ENABLE pin, causes and IRQ low/high toggle sequence
//             from the CC3000 to inidcate that its internal RESET is complete.
//             This sequence is handled
//*****************************************************************************
void  WriteWlanPin (unsigned char hi_lo_val)
{
    if (hi_lo_val)
       {
         CC3000_ENABLE_HIGH();  // Enable  WIFI chip - will cause an IRQ toggle
       }
      else
       {
         CC3000_ENABLE_LOW();   // Disable WIFI chip
       }
}
#endif                          //  end  #if defined(USES_CC3000)


/******************************************************************************/
